[
    {
        "index": "0",
        "price": "$180.00",
        "due_days": "due in 4 days",
        "title": "Add ability to mint an NFT based on score (https://replit.com/@jgrinnell0/cryptoforwardalpha?v=1)",
        "description": "Users who connect to the dapp should be able to mint their scores as a non-transferrable NFT which displays their score. Here's an example: https://mintkudos.xyz/community/LearnWeb3?tab=Kudos&tokenId=14597\n\nAcceptance Criteria\n: there should be a button in the UI that allows users to mint a non-transferrable NFT on Polygon, after a user has connected their wallet and shown their score\n: the non-transferrable NFT should have a consistent, clean design, and display the users' score and ETH/Polygon address\n\n#code\nUse the code/repo here, fork it, and send me the code you write: https://replit.com/@jgrinnell0/cryptoforwardalpha?v=1",
        "author": "jgrinnell0",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@jgrinnell0/add-ability-to-mint?t="
    },
    {
        "index": "1",
        "price": "$10.00",
        "due_days": "due in 8 days",
        "title": "⌚️ Apple Watch Compass App (Orientation Based Vibration) [Swift]",
        "description": "Trying to see the possibility of an Apple Watch app that notifies (vibration) the user when they are facing North. That's all. No need for other features. No connection to phone/internet.\n\nIt would (I believe) primarily use this feature: https://developer.apple.com/documentation/coremotion/cmmagnetometerdata/1616084-magneticfield\n\nAnd would use the Apple Watch 5 and Later for magnometer (compass) feature.\n\nMVP: If user's wrist is facing 'north', slightly vibrate for 1s.\n\nAcceptance Criteria\nMVP or potential for MVP.\nA TestFlight ready app that vibrates for 1s when the user faces North each time.\ne.g. I walk and turn east, no vibration\nI keep waking and turn north, slight 1s vibration.\nI turn west, no vibration.\nI turn north again, 1s vibration.",
        "author": "Bandos1000",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@Bandos1000/apple-watch-compass?t="
    },
    {
        "index": "2",
        "price": "$90.00",
        "due_days": "due in 2 days",
        "title": "Create a modal in react using the UX mockup provided.",
        "description": "Create a modal in react js using the UX mockup provided\nImage Grid - A vertically scrollable list of images. The backend api will be provided to you. On hover each image should show an enlarge/preview icon, which should show just the image in another full screen modal\n\nNew Images Button - When this button is clicked, an api request must be made, the 'New Images Grid' should show a loader while the api request is being processed. When the api request is complete, the  grid should show the returned images as a 2*2 grid. The backend api will be provided.\n\nThis is primarily a design job , so in addition to the UX, a good looking UI also needs to be implemented.\n\nmockup - https://drive.google.com/file/d/1SlQCEoTEp6xOCregwVJLt2744nt4rGcb/view?usp=sharing\nAcceptance Criteria\nAll the functionality as mentioned needs to be tested and completed.",
        "author": "mahendranaik",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@mahendranaik/create-a-modal-in-re?t="
    },
    {
        "index": "3",
        "price": "$5.00",
        "due_days": "due in 11 days",
        "title": "📊 Basic Front End + DataPull for RuneScape competition",
        "description": "Trying to create an epic website to see the status of the Speedrun competition in OSRS.\nI've made a quick frame of it here: https://www.figma.com/file/3anndl61BWgpo0Kpzewhpr/OSRS-Proj?node-id=1%3A2&t=VYyI0mIMSQzxnqh4-1\n\nIdeally, would work on Mobile and Web. Not sure what the best way to build this is.\nI'll need to manually enter the:\nSpeedrunner names\nSpeedrunner Youtube/Twitch channels\n\nThe most challenging aspect is pulling a iframe from https://wiseoldman.net with a selected username: https://wiseoldman.net/players/phonk%20addict\nAnd only displaying the stats section (as seen in Figma)\n\nI think there are 2-6 right now. I would like the ability to add more speed runners in the future.\nAcceptance Criteria\nA stunning website to see who is currently winning/speedrunning OSRS. I will connect a custom domain after delivery.\nI have no problem with crediting you/linking your Replit profile on the site.",
        "author": "Bandos1000",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@Bandos1000/basic-front-end-data?t="
    },
    {
        "index": "4",
        "price": "$135.00",
        "due_days": "closed",
        "title": "GPT3 AI Story Video Generator",
        "description": "I would like to create a tool that can create Story Videos based on prompts. It can be a simple command line tool, no need for a website or app.\n\nUser inputs story prompt (ex. A story about a girl and a big mountain)\nStory is given to GPT-3 API, in a way so that it gives the story text and descriptions of images for the story (to be used by DALLE-2)\nImage prompts from GPT-3 output will be fed to DALLE-2 API (or a different image generating AI)\nStory is read by Text-To-Speech API (for ex. Azure Cognitive Services)\nAudio and Images are combined to create a single video using the https://remotion.dev library.\n\nBasically, the tool should be written in JavaScript, retrieve data from all the required APIs, and use the Remotion library to create a video from these outputs.\n\nI am a coder myself who has used all these API's and libraries before, and I can provide support if you need any help.",
        "author": "CoderGautamYT",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@CoderGautamYT/gpt3-ai-story-video?t="
    },
    {
        "index": "5",
        "price": "$135.00",
        "due_days": "due in 26 days",
        "title": "AI Story Video Generator Tool",
        "description": "I would like to create a tool that can create Story Videos based on prompts. It can be a simple command line tool, no need for a website or app.\n\nUser inputs story prompt (ex. A story about a girl and a big mountain)\nStory is given to GPT-3 API, in a way so that it gives the story text and descriptions of images for the story (to be used by DALLE-2)\nImage prompts from GPT-3 output will be fed to DALLE-2 API (or a different image generating AI)\nStory is read by Text-To-Speech API (for ex. Azure Cognitive Services)\nAudio and Images are combined to create a single video using the Remotion library.\n\nBasically, the tool should be written in JavaScript, retrieve data from all the required APIs, and use the Remotion library to create a video from these outputs.\n\nI am a coder myself who has used all these API's and libraries before, and I can provide support if you need any help.",
        "author": "CoderGautamYT",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@CoderGautamYT/ai-story-video-gener?t="
    },
    {
        "index": "6",
        "price": "$9.00",
        "due_days": "closed",
        "title": "Multiplayer Battle System For Arrowfall",
        "description": "Must a create a server that you can join the in start of the game\nYou then can create rooms/arenas and wait for players to join\n\nAlso then you can battle other players\nI have already created a battle system so you just make it so you can battle someone else instead of just monsters\n\nPlease be experienced and not just use ChatGPT",
        "author": "OverdriveReplit",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@OverdriveReplit/multiplayer-battle-s?t="
    },
    {
        "index": "7",
        "price": "$360.00",
        "due_days": "due in 12 days",
        "title": "Build a benchmarker for NFT APIs / RPCs",
        "description": "Many new companies have built NFT indexers that exist to reliably serve data on digital assets in a fast, Web2 performant way. Unfortunately, many of them do not actually hold up to these claims. This bounty should build a way to benchmark those APIs on a frontend.\n\nAcceptance Criteria\nNextJS frontend\nAbility to spawn {X} random NFTs that are served from {Y} endpoint\nCompare network payloads, response times, and cost per call\n\nServices:\nstraight RPC calling of Shadowdrive / Arweave\nPinata\nLollipop.xyz\n\nCan use libraries like https://github.com/grafana/k6",
        "author": "rmshea",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@rmshea/build-a-benchmarker?t="
    },
    {
        "index": "8",
        "price": "$18.00",
        "due_days": "due in 13 days",
        "title": "Clojure query for Roam: number of [[POMO]] per day",
        "description": "I'd like to visualize the POMOs I've done across time in Roam Research. I'm looking for stats I can easily copy-paste to a spreadsheet.\n\nAcceptance Criteria\nShows the POMOs I've done per day in Roam\n\nExamples of queries: https://roamresearch.com/#/app/Zsolt-Blog/page/WUn5PuTDV",
        "author": "KahlilCorazo",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@KahlilCorazo/clojure-query-for-ro?t="
    },
    {
        "index": "9",
        "price": "$90.00",
        "due_days": "due in 13 days",
        "title": "AI-based Data Engine ",
        "description": "Make financial data easily accessible\n\nAcceptance Criteria\nAn engine that hooks various official financial sources and leverages NLP (via GPT-3) to pull up data from these financial sources and format it in an excel table while also generating a small piece of news around that data.\n\nI will be happy to give more details once the applications have been approved.",
        "author": "GennaroCuofano",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@GennaroCuofano/ai-based-data-engine?t="
    },
    {
        "index": "10",
        "price": "$20.70",
        "due_days": "due in 4 days",
        "title": "Build a webapp that uses GPT-3 to execute a series of actions on the web through Playwright",
        "description": "Essentially we are looking for a web app version of the Natbot:\nhttps://github.com/nat/natbot\n\nAcceptance Criteria\nDesign the front end using HTML, CSS, and JavaScript and the backend using Python and the Flask framework.\n\nThe Web app is basically a simple Title (GPT Browser Actions) and a textfield input for the prompt. The following prompts should work:\n\"Search google for the best hotels around me\"\nResult: A new browser page is opened, goes to google.com, enters best hotels around me, all based on GPT3 providing playwright code to execute as in the example of Natbot\n\"Search Paris on Google Maps\"\nResult: A new browser page is opened, goes to maps.google.com, searches Paris",
        "author": "mrock3",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@mrock3/build-a-webapp-that?t="
    },
    {
        "index": "11",
        "price": "$90.00",
        "due_days": "due in 13 days",
        "title": "React-Table / Similar to Monday.com",
        "description": "I'm the founder of mapsheet.com and I am trying to help my engineers test and build new features faster. Our software is quite complicated now so I want a parallel environment where I can explore ideas and features without getting in the way.\nAcceptance Criteria\nA spreadsheet built in react-table where the cells in each column are a specific data type (number, currency, date, short text, date, address etc) with the following columns:\nAddress column pinned/frozen to the far left\nShort text column\nShort text column\nDate column\nCurrency column\nNumber column\nNumber column\nCurrency column\n\nAdditionally, please include the following features:\nresizable column widths\ndrag & drop to rearrange column order\nadd a new column and set column type as date, number, currency, or short text",
        "author": "willzt",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@willzt/react-table-similar?t="
    },
    {
        "index": "12",
        "price": "$450.00",
        "due_days": "due in 13 days",
        "title": "Reddit Parody & Meme Home Page Creator w/ Mash Monetization",
        "description": "We want to create a meme builder specifically for a fake reddit home page, hot section, to enable people to create a joke that they want, and easily download + share it. The inspiration is the \"breaking news\" generator. The goal here is to showcase how a mini-app that is fun can monetize premium features.\n\nAcceptance Criteria\nCreate a mini-web-app that allows users to create a Fake Reddit Home Page – where they can customize specific elements.\nUsers can customize the top right user handle and karma,\nUsers can customize the top two posts, specifically votes, posted by name, subreddit part of, comments, image showcased and of course, the headlines text.\nThere is a default setup so that the canvas isn't blank\nThe look/feel and design of the fake post should mimic what is currently live on reddit, with some subtle differences (e.g., Redddit instead of Reddit) so that it is apparent it isn't real\nA live preview of the changes are shown to the user, with a watermark/url o...",
        "author": "jarednxx",
        "posted_time": "8 hours ago",
        "link": "https://replit.com/bounties/@jarednxx/reddit-parody-and-me?t="
    },
    {
        "index": "13",
        "price": "$22.50",
        "due_days": "due in 13 days",
        "title": "Wrist Measurer For Apple Watch Solo Loop Band ",
        "description": "An app that measures your wrist for an apple watch solo loop band using the iPhone camera and LiDAR sensor\n\nAcceptance Criteria\nMeasure the wrist and get number results based on what a tailor’s measuring tape would say.\n\nNo login needed just go directly to doing it.\n\nDetailed instructions will pop up while doing it, showing you how to measure and get the correct results\n\nExtreamly clear, smooth modern interface and design\n\nMake each scan as accurate as possible\n\n$.99 for each wrist scan the app itsself is free\n\nIf the payment is not enough or you know something I don’t that I should add let me know",
        "author": "atlasxbeaumont",
        "posted_time": "8 hours ago",
        "link": "https://replit.com/bounties/@atlasxbeaumont/wrist-measurer-for-a?t="
    },
    {
        "index": "14",
        "price": "$450.00",
        "due_days": "due in 13 days",
        "title": "Web app that will generate recipes using AI",
        "description": "I am looking to develop a simple web app that allows users to generate recipes with the help of AI.\n\nThe web app should allow users to submit a recipe name, hit generate, and have an AI return a step-by-step guide to produce the recipe.\n\nThere should also be additional, optional fields for users to enter:\nNumber of servings desired\nDietary restrictions\nPreferences\n\nAlso to be included is an additional tick box labelled 'Surprise me' which will prompt the AI to add a surprise additional ingredient.\n\nAcceptance Criteria:\nFront end and design that is simple and focuses on the form for the user to submit information\nUsers have access to a responsive, clean form and can enter recipe name, dietary restrictions, preferences, etc.\nThe web app successfully generates a response with a step-by-step recipe with criteria matching the user's preferences",
        "author": "stanbm",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@stanbm/web-app-that-will-ge?t="
    },
    {
        "index": "15",
        "price": "$13.50",
        "due_days": "due in 3 days",
        "title": "LinkedIn analytics in Python",
        "description": "I am the Super Admin of a company LinkedIn page & want to import all my data using the LinkedIn API in Python to enable my own data analysis. The data I need is: engagement data on every post, follower data & page visits for a given date range.\n\nAcceptance Criteria\nGiven a company id (e.g. 1234), date range (e.g. 01/01/22 - 31/12/22) I can call a script that saves down into three different csv's the above data ie posts.csv, followers.csv & visitors.csv\nAssume user has full administrative access to the page & the application development tier is 'Marketing Developer Platform' (ie clientid & clientsecret will have correct permissions)\nThe script will enable 3-legged OAuth needed to extract certain data https://learn.microsoft.com/en-us/linkedin/shared/authentication/authorization-code-flow?context=linkedin%2Fcontext&tabs=HTTPS1",
        "author": "kushmadlani",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@kushmadlani/linkedin-analytics-i?t="
    },
    {
        "index": "16",
        "price": "$100.00",
        "due_days": "due in 2 months",
        "title": "Discord Bot + Replit Status Page Integration",
        "description": "Whenever I update the replit status page, it's annoying to have to post in discord what we just posted on the status page.  I want a discord bot that checks the replit status page at an interval of once per five minutes and posts every time there's an update or an incident.\n\nAcceptance Criteria\nThe discord bot should post an embed at every update only if something changes.\nAs stated above, the discord bot should check the status page at an interval of once every five minutes.  For more information on how to use the api to access the status of replit, check out this repl.\nThe embed message should display the following information:\n Status (investigating, resolved, etc)\n Title\n Description\n Time when the status page was last updated\n The title of the embed should link to the status page (https://status.replit.com)\n Domain / Area affected (replit.com, repl.co, blog.replit.com, etc)\n Time between current incident and the last incident\nWhen an incident's status is update...",
        "author": "ReplitIronclad",
        "posted_time": "23 hours ago",
        "link": "https://replit.com/bounties/@ReplitIronclad/discord-bot-replit-s?t="
    },
    {
        "index": "17",
        "price": "$1,000.00",
        "due_days": "due in 25 days",
        "title": "$1000 for best 140-second AI film on Satoshi Nakamoto",
        "description": "Hollywood is not going to tell an accurate story about Bitcoin when they finally make the Satoshi movie, so we as a decentralized community of creators must tell it ourselves. Instead of doing a 140 minute film using a studio, let’s create a 140 second film about Satoshi Nakamoto using AI.\n\nAcceptance Criteria\nMust be around 140 seconds (+/- 10 sec).\nMust be created with AI\nMust be about Satoshi Nakamoto\nMust tell a story with a beginning, middle, and end.\nMust reply to tweet (https://twitter.com/patrickwstanley/status/1610345715737464832?s=46&t=IBFj6XibJAETsBtV0YmA) by 1/31/23 to qualify",
        "author": "PatrickStanley",
        "posted_time": "23 hours ago",
        "link": "https://replit.com/bounties/@PatrickStanley/dollar1000-for-best?t="
    },
    {
        "index": "18",
        "price": "$40.50",
        "due_days": "due in 26 days",
        "title": "Specifications Grading Tool",
        "description": "Simplify grading entire classes through a single-page interface connected to profiles that can be updated and exported/printed.\n\nAcceptance Criteria\nA single page with a search or drop-down menu that calls up individual student profiles below.\nAn option nearby for adding new student profiles.\nIn each profile five categories/sections are present:\n   Three equally prominent categories/sections labelled \"Bundle A\", \"Bundle B\" and \"Bundle C\".\n   A fourth category/section of equal size but less prominence labelled \"Bundle D\".\n   A fifth category/section labelled \"Tokens\".\n\nIn the first four sections there should be an option to \"Add an assessment\" where a simple title can be input with text (or preselected from recently used options). When added to that section, each assessment should be able to be toggled between \"below standard\", \"to standard\" or \"to standard with distinction\".  A final click box should be available with \"removed\" as an option, if clicked the assessmen...",
        "author": "T-WW",
        "posted_time": "1 day ago",
        "link": "https://replit.com/bounties/@T-WW/specifications-gradi?t="
    },
    {
        "index": "19",
        "price": "$94.50",
        "due_days": "due in 10 days",
        "title": "Workflowy-esque AI Todo list expander",
        "description": "Sometimes a particular task can be daunting, leading to procrastination. An effective solution is to break the task down into a number of simpler, more approachable subtasks. If any of those tasks are still intimidatingly, they can be further subdivided.\n\nWorkflowy.com pioneered an infinitely nestable outline interface which is conducive to this type of task subdivision. This bounty is to create a prototype app which improves upon Workflowy by using a LLM to assist in task subdivision.\n\nAcceptance Criteria\n A workflowy-esque webapp, with an intuitive UI allowing the user to build an infinitely nestable outline.\n A function which automatically creates nested subtasks for any given task by using an LLM, such as GPT3\n Your choice of web framework",
        "author": "dougfeig",
        "posted_time": "22 hours ago",
        "link": "https://replit.com/bounties/@dougfeig/workflowy-esque-ai-b?t="
    },
    {
        "index": "20",
        "price": "$180.00",
        "due_days": "due in 2 days",
        "title": "Build custom excel report that gets external data from various advertising and ecommerce platforms",
        "description": "My current workflow is to manually run daily reports on TikTok, Meta, Google, Shopify (and more) and manually input the data into an excel spreadsheet to generate a daily report.\n\nAcceptance Criteria\nAn automated report using Microsoft Excel Power Query (or other) to import, combine data from multiple sources and shape it into a daily report format I have created.",
        "author": "MikeZapata",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@MikeZapata/build-custom-excel-r?t="
    },
    {
        "index": "21",
        "price": "$5.00",
        "due_days": "closed",
        "title": "Notion CSS Competition #1 -- Happy New Year! 🎉",
        "description": "Notion Design Competition to Start 2023 and Earn Some Cycles! 🔁\nHey all! Do you like front end? (Me neither.)\nAre you trying to complete some bounties or practice your CSS skills? This is the competition for you.\nI'll be creating 10 of these bounties. Each 'solution' will be posted on a Twitter thread at the end.\n1st Place: 2,000 cycles or 3 months of Hacker. (I don't know if I can gift Hacker, but we'll figure that out.)\n2nd Place: 1 month of Hacker/1,000 Cycles\n3rd Place: Bragging rights and the bronze medal emoji 🥉 + (Or I'll fund you a bounty for a collaborative project.)\n\nTLDR: Everyone starts with the same framework and throws their own styling on it.\n\nHow To Compete:\n-1. Get Inspired: https://www.kseniiakrasilich.com/squarespace-help/best-notion-websites\nIf it looks fun, apply for a Bounty. If you're not accepted to #1, apply to another. There are only 10 slots. Sorry!\nFork this Repl: https://replit.com/@Bandos1000/NotionSimplifyReplit#styles/notion.css\nCheck the Rules\nDesign ...",
        "author": "Bandos1000",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@Bandos1000/notion-css-competiti?t="
    },
    {
        "index": "22",
        "price": "$13.50",
        "due_days": "due in 3 days",
        "title": "Housekeeping/Code Cleanup for Notion/Replit Connector [TS/JS]",
        "description": "Looking for some help with a cleanup/error fix for this Repl.\nhttps://replit.com/@Bandos1000/NotionCompetition2023#site.config.ts\nHas a bunch of additional folders/files that are no longer needed after it was moved to Replit. Looking to remove anything that was previously needed when it was hosted on Github. (+ clean up a few errors.)\n\nThis is where it's from:\nhttps://github.com/transitive-bullshit/nextjs-notion-starter-kit\n\nLooking to remove all the pieces that used to be used for Vercel since it's now 'hosted' in Replit.\n\nAcceptance Criteria\nA simplified version of the Repl above, with all non-vital dependancies removed and file structure simplified.",
        "author": "Bandos1000",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@Bandos1000/error-fix-for-notion?t="
    },
    {
        "index": "23",
        "price": "$90.00",
        "due_days": "due in 12 days",
        "title": "Clothing image recognition script",
        "description": "Would like a simple app likely using computer vision (eg Roboflow) where user can upload a photo of clothing and app returns the clothing article type and main color: t-shirt, pants, sock, button down shirt, sweater, etc\n\nAcceptance Criteria\nUser can upload photo\nApp returns photo with description of what article of clothing and color the photo has",
        "author": "Matthew_Morriso",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@Matthew_Morriso/clothing-image-recog?t="
    },
    {
        "index": "24",
        "price": "$0.90",
        "due_days": "due in 27 days",
        "title": "Coder Gautam, pls follow me!",
        "description": "Please follow me @CoderGautamYT, and I'll give you a buck!",
        "author": "MNA4",
        "posted_time": "8 hours ago",
        "link": "https://replit.com/bounties/@MNA4/coder-gautam-pls-fol?t="
    },
    {
        "index": "25",
        "price": "$180.00",
        "due_days": "due in 3 days",
        "title": "Endpoint that gets URL of a file and saves it in Google Drive",
        "description": "I want an endpoint that will get the following parameters:\nURL of a file to download (files will be audio or video, so most likely hundreds of MBs in size\nGoogle Drive Folder ID to store the file in\nGoogle Drive token\n\nAcceptance Criteria\n\nThis can be implemented in GCP or AWS, in Python or JS.\n\nThe endpoint will download the file from the URL, and upload it to the Google Drive folder given in the parameters, using the token provided in the parameters.\n\n-- If the Google Drive authentication fails, the function will return an HTTP error code\n--  If the download fails to complete, the function will return an HTTP error code\n-- If the upload to Google Drive fails to complete, the function will return an HTTP error code\n-- If the upload to Google Drive is completed successfully, the function will delete the file from its temporary location (assuming it will be downloaded to someplace before being uploaded to Google Drive - like google cloud storage or S3), and return th...",
        "author": "alonwpoplar",
        "posted_time": "16 hours ago",
        "link": "https://replit.com/bounties/@alonwpoplar/endpoint-that-gets-u?t="
    },
    {
        "index": "26",
        "price": "$180.00",
        "due_days": "due in 13 days",
        "title": "Scrape structured data on website and scrape any updates going forward",
        "description": "Seeking market intelligence on public sector tenders (RFPs) offered and awarded for the category of 'feasibility study'.\n\nAcceptance Criteria\nScrape data from this website https://www.bidsandtenders.com/suppliers/bid-opportunities/\nI am only interested in data from Canada.\nThe only type of tender data I am interested in retrieving is identified as 'feasibility study'\nI want a database of ALL tenders offered and awarded for feasibility studies in Canada (open, and closed as far back as 2015)\ndata should be in an excel friendly format.\nData should include ALL fields listed on web url listed above (bid name, status, published date, closing date, organization) AS WELL AS data provided for each listing (data found when clicking the 'view' button).\nI am seeking ALL data on the relevant individual listings.\nI would also like to download ALL documents in the 'documents' section of individual listing.\ndownloaded documents should contain filename with a reference ID linking t...",
        "author": "Populista",
        "posted_time": "11 hours ago",
        "link": "https://replit.com/bounties/@Populista/scrape-structured-da?t="
    },
    {
        "index": "27",
        "price": "$9.00",
        "due_days": "closed",
        "title": "Need a Tamil Speaker for Data Entering",
        "description": "நான் தமிழ் கற்க ஒரு website செய்கிறேன்\nஅதில் வார்த்தைகளை வைக்க, எனக்கு தமிழ் பேசுபவர் வேண்டும்\nஇதற்கு, coding அனுபவம் தேவையில்லை\n\nநான் சேர்க்க வேண்டிய வார்த்தைகள் பற்றிய விவரங்களை தருவேன்\n\nPlease submit your application in Tamil, do not apply for this bounty if you aren't a native Tamil speaker.",
        "author": "CoderGautamYT",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@CoderGautamYT/need-a-tamil-speaker?t="
    },
    {
        "index": "28",
        "price": "$40.50",
        "due_days": "due in 6 days",
        "title": "Podcast screenshot reader - Coded in Python",
        "description": "Using Python code, we need to be able to read a screenshot taken on a phone when someone is listening to a podcast and extract the left most time stamp e.g., 5:15.  Then turn this  time into a number of seconds (in this case 60*5 plus 15 = 315) into the podcast when they screenshot was taken.\nWe also want to extract and read the date of the podcast and as much of the text of the podcast title as is visible in the screenshot.\n\nAcceptance Criteria\n\nPython code which can execute the above task accurately on 10 podcast screenshots , which we will supply.\n\nTechnical Details\n\nLink to Project",
        "author": "YorkvilleDS",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@YorkvilleDS/podcast-screenshot-r?t="
    },
    {
        "index": "29",
        "price": "$45.00",
        "due_days": "due in 2 days",
        "title": "Help explore how to train a custom fine tuned model for re-creating consistent scenarios in my cartoon from different camera angles",
        "description": "First, you will need to gather a dataset of images or video frames that represent the different camera angles of the scenarios you want to recreate. This dataset should contain a variety of different angles, including close-ups, wide shots, high angles, low angles, etc.\n\nPreprocess your dataset by cropping, resizing, and/or normalizing the images or video frames as needed.\n\nSplit your dataset into training and validation sets. The training set will be used to train your model, while the validation set will be used to evaluate the model's performance during training.\n\nChoose a deep learning model architecture that is suitable for your task. There are many different architectures to choose from, such as convolutional neural networks (CNNs) or recurrent neural networks (RNNs).\n\nFine-tune the chosen model on your training set by adjusting the model's hyperparameters and training it for a number of epochs. You may want to use a technique like transfer learning to make the training process m...",
        "author": "justinrogers123",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@justinrogers123/help-explore-how-to?t="
    },
    {
        "index": "30",
        "price": "$45.00",
        "due_days": "due in 4 days",
        "title": "Perform Conversion Rate Mix Analysis based on multiple inputs",
        "description": "For a website that has traffic coming from many sources, need to understand what is impacting conversion rate. Is it actual performance of the site, or mix between several different vairables\n\nVariables includes are\ndate:  day\nregion: americas, apac, europe, other\nshopper: new or repeat\ndevice: desktop, mobile web, tablet, iOS, Andoid, other\nMarketing channel: direct web, direct app, semu, semb, paid, seo, meta, affliates, social, CRMs, CRMm, unknown\n\nhere is a simple version of this done with only a few factors\nhttps://www.goodmarketing.club/guide/how-to-explain-channel-conversion-rate-change-with-mix-rate-bridging-analysis/\n\nAnalysis needs to be done on a YoY basis to account for seasonality\nAnalysis needs to be able to be done last 7 days and previous 7 days to understand what changed week to week\nAcceptance Criteria\n\nTechnical Details\n\nLink to Project",
        "author": "DavidEagan1",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@DavidEagan1/perform-conversion-r?t="
    },
    {
        "index": "31",
        "price": "$16.20",
        "due_days": "due in 2 days",
        "title": "Write a node function to log in to Fantrax.com and return the FX_RM cookie.",
        "description": "I'm looking for a function given a users credentials can programmatically bypass Fantrax's auth and return the FX_RM cookie.\nAcceptance Criteria\nYou may use anything that can be deployed. (No Chromium in non-headless mode).  If you choose to do it this way. please make sure your code works while calling a service like https://www.browserless.io/.\n\nideally you don't need to use selectors and can write it by simulating the requests.\nTechnical Details\n\nLink to Project",
        "author": "mlchiang",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@mlchiang/write-a-node-functio?t="
    },
    {
        "index": "32",
        "price": "$90.00",
        "due_days": "closed",
        "title": "Create a scraper template I can use with typescript and puppeteer",
        "description": "I would like a simple scraper template I can build on. I am not familiar with replit so would like a starting point.\n\nAcceptance Criteria\nThe project should start with the typescript replit template\nThe scraper should use puppeteer-extra-plugin-stealth\nThe scraper should take a screenshot of google.com and store it locally\nThe project should run from /src/index.ts",
        "author": "drninja777",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@drninja777/create-a-scraper-tem?t="
    },
    {
        "index": "33",
        "price": "$1.98",
        "due_days": "due in 5 days",
        "title": "Need A Discord Bot With Simple Commands Listed Below",
        "description": "Im making a new server and need a bot that can act as utilities.\n\nAcceptance Criteria\nYou should be able to make the bot with following commands.\nlock/unlock\ntickets\nembed a message\ncustomizable user logs i set myself\nreaction roles\nmusic would be optional but a huge bonus.\n\nMost of these I've seen easily done in other bots and you may have done already is why im not giving as many credits as I could (also, im running out, lol)",
        "author": "JoeyLucas1",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@JoeyLucas1/need-a-discord-bot-w?t="
    },
    {
        "index": "34",
        "price": "$9.00",
        "due_days": "due in 3 days",
        "title": "\"Koi Pond\" Interface for Aphorisms",
        "description": "I have a Python Flask App project I am working on dealing with Aphorisms:\nhttps://replit.com/@Dprevoznik/Aphorisms?v=1\n\nI would like someone to update the existing \"/\" index page, so that the Aphorism tiles float in from any direction of the screen and float out from another direction. Once they have all floated out of the screen, the \"/random-aphorisms\" endpoint should be called so that the screen is endlessly filled with aphorism tiles. The feel I am going for is a Koi Pond where they float in and out slowly, so users can read the tiles.\n\nAcceptance Criteria\nThe index.html page should load in 8 random tiles from aphorisms.json at a time and have them float across the screen at different times.\nThe tiles should randomly enter from one side of the screen (left, right, top, bottom) and exit out of another side of the screen (left, right, top, bottom) in a straight line.\nThe html page should dynamically call the \"/random-aphorisms\" endpoint from the Python Flask app t...",
        "author": "Dprevoznik",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@Dprevoznik/koi-pond-interface-f?t="
    },
    {
        "index": "35",
        "price": "$20.00",
        "due_days": "closed",
        "title": "[Small Bug] Allow FinBERT ai model to run a simple python script in replit ",
        "description": "This finBERT model python sentiment analysis script runs fine in jupyter notebooks/ Google Colab but results in an error when trying to run it in replit. Here is the traceback:\n\nTraceback (most recent call last):\n  File \"sentiment_analysis.py\", line 1, in\n    from transformers import BertTokenizer, BertForSequenceClassification\n  File \"\", line 1039, in handlefromlist\n  File \"/home/runner/Finbert/venv/lib/python3.8/site-packages/transformers/utils/importutils.py\", line 1084, in getattr_\n    value = getattr(module, name)\n  File \"/home/runner/Finbert/venv/lib/python3.8/site-packages/transformers/utils/importutils.py\", line 1083, in getattr_\n    module = self.getmodule(self.classto_module[name])\n  File \"/home/runner/Finbert/venv/lib/python3.8/site-packages/transformers/utils/importutils.py\", line 1095, in get_module\n    raise RuntimeError(\nRuntimeError: Failed to import transformers.models.bert.modeling_bert because of the following error (look up to see its trace...",
        "author": "MasonCorliss",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@MasonCorliss/small-bug-allow-finb?t="
    },
    {
        "index": "36",
        "price": "$10.00",
        "due_days": "due in 6 months",
        "title": "Create a v2.022 Cookie Clicker Save Editor ( Like coderpatsy )",
        "description": "What I want\nI want to discern and be able to modify save files like it has been done in the past like in v1.0466 and v2.048, but I want it to be for v2.022, be able to do all of the same things as the v2.048 ( up to the limitations of the version ), and include save fixing, bug reporting, and it to be able to determine if the save code is or is not from v2.022, basically all I want is the what coderpatsy did, but for v2.022, and I also want it to include a method of fixing the save data in a way that it does not mess up the in-game achievements, upgrades purchased, etc.\nQuestions?\nDiscord: Altify#0016\nForums\nAdditional Info/Updates - Check Before Application, if blank page, nothing changed, if content, click the visit blog button, yes I made a blogging site just for updates since you cant update a bounty.",
        "author": "Altify-Developm",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@Altify-Developm/create-a-v2022-cooki?t="
    },
    {
        "index": "37",
        "price": "$247.50",
        "due_days": "due in 3 days",
        "title": "AI based resume sorter",
        "description": "Create a Google sheets add on which,\ngiven a Google sheet with LinkedIn profiles of candidates, fill out the additional columns about the candidates.\n\nYears of experience in given field\nDid they graduate from top schools? (Yes/No) [Can scrape a list of top schools online]\nDid they work at top startups? (Yes/No)\nSummary of their experience\n\nAcceptance Criteria\nA Google sheets add on which does the above will be accepted. Need the code as well, ofc.\n\nTechnical Details\nScraping LinkedIn might be the hardest part, use headless browsers if you will or some other tools.\nOpenAI keys tokens will be provided. Use the language or stack of your choice.\n\nBonus\nAllow the user to ask new questions on candidates profile.",
        "author": "HarshGupta64",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@HarshGupta64/ai-based-resume-sort?t="
    },
    {
        "index": "38",
        "price": "$9.00",
        "due_days": "due in 3 days",
        "title": "Simple python script to modify a Photoshop file",
        "description": "I want to be able to modify Photoshop mock up files within my python app. The File has a smart object. The content of the smart object needs to be changed.\n\nExample File:\n\nhttps://www.freepik.com/free-psd/jerzees-pullover-hooded-sweatshirt-mockup_5533437.htm\n\nAcceptance Criteria\n\nWrite the following in python:\n\nOpen PSD file\nReplace the PNG file in the smart object layer.\nsave as JPG file\n\nI tried to do this with the psdtools library, but didn't get it to work.\n\nNote: I don't want to run Photoshop on my machine and interact within via API. It should run inside a python app.",
        "author": "PaulDelmann",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@PaulDelmann/simple-python-script?t="
    },
    {
        "index": "39",
        "price": "$200.00",
        "due_days": "due in 13 days",
        "title": "Build a scraper that can work on many different job sites",
        "description": "I want a scraper that can take in any careers page URL and output the job title and links to apply in the console.\n\nAcceptance Criteria\nApp must use pupeteer stealth and be written in typescript\nApp must correctly scrape a list of ~50 pages I will supply\nApp finds job listing using an array of likely job titles and then finds other matching jobs on the page\nApp looks for links on the jobs and outputs a list of job titles + the link to click on and view the full job.",
        "author": "drninja777",
        "posted_time": "7 hours ago",
        "link": "https://replit.com/bounties/@drninja777/build-a-scraper-that?t="
    },
    {
        "index": "40",
        "price": "$45.00",
        "due_days": "due in 24 days",
        "title": "Dream Studio API text to image +  vertical marketplace to buy/sell commercialize the physical versions",
        "description": "Text to image generation for physical products is a great tool for inspiration but does not yield production ready design (except possibly for printed products.) For other products (like a shoe for example), professionals are needed, such as traditional product and CAD designers and factory producers.\n\nMy idea is a website that will be a 2 way marketplace to bridge the gap between inspirational designs created by amateurs and pros alike, and the professionals and producers who can turn those designs into reality. AI designs created by anyone can be offered on the site for sale as either concepts, production ready, or actually produced, with the proceeds divided among those involved in bringing them to life.\n\nIt will be somewhat similar to a dribbble.com, artstation.com, or an unsplash.com, but instead of the offerings being created offsite and uploaded, the image creation will take place on our site via dreamstudio api.\n\nThis site will allow anyone, with no (industr...",
        "author": "Amber332",
        "posted_time": "7 hours ago",
        "link": "https://replit.com/bounties/@Amber332/dream-studio-api-tex?t="
    },
    {
        "index": "41",
        "price": "$5.40",
        "due_days": "due in 13 days",
        "title": "Try out our Minecraft bot / AI tutorial!",
        "description": "Hey there! We are releasing a platform to compete with bots in games! We are looking for folks to try out our first tutorial and provide feedback on the experience, before we release the template to the entire community.\n\nEstimated time to complete: ~30 minutes\n\nIn this tutorial, you will use our platform on https://play.regression.gg to build a Minecraft bot to hunt animals for points in our Ultimate Collector challenge.\n\nTutorial: https://replit.com/@RegressionGames/Harvest-Animals-Bot-Regression-Games?v=1\n\nAcceptance Criteria\nGo through the tutorial\nMake notes about issues you encounter (message us if there are any blockers)\nProvide suggestions and feedback on both the tutorial and general experience",
        "author": "RegressionGames",
        "posted_time": "7 hours ago",
        "link": "https://replit.com/bounties/@RegressionGames/try-out-our-minecraf?t="
    },
    {
        "index": "42",
        "price": "$5.40",
        "due_days": "closed",
        "title": "Try out our Minecraft bot / AI tutorial!",
        "description": "Hey there! We are releasing a platform to compete with bots in games! We are looking for folks to try out our first tutorial and provide feedback on the experience, before we release the template to the entire community.\n\nEstimated time to complete: ~30 minutes\n\nIn this tutorial, you will use our platform on https://play.regression.gg to build a Minecraft bot to hunt animals for points in our Ultimate Collector challenge.\n\nTutorial: https://replit.com/@RegressionGames/Harvest-Animals-Bot-Regression-Games?v=1\n\nAcceptance Criteria\nGo through the tutorial\nMake notes about issues you encounter (message us if there are any blockers)\nProvide suggestions and feedback on both the tutorial and general experience",
        "author": "RegressionGames",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@RegressionGames/try-out-our-minecraf-1?t="
    },
    {
        "index": "43",
        "price": "$27.00",
        "due_days": "due in 9 days",
        "title": "Add Enemies to a Phaser3 Game",
        "description": "I have a simple Phaser3 game, and I'd like help adding enemies to it.\n\nAcceptance Criteria\nHere is the replit with the existing game: https://replit.com/@dwp/simpleGamePlusEnemies\n\nI'm looking for someone who can:\nAdd 3 enemy sprites at random locations on the map.\nHave the enemies move in random directions but shouldn't be able to move through the walls.\nWhen an enemy collides with the player sprite, show an alert saying \"Game Over!\"",
        "author": "dwp",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@dwp/add-enemies-to-a-pha?t="
    },
    {
        "index": "44",
        "price": "$81.00",
        "due_days": "due in 4 days",
        "title": "Chrome extension with google login and api integations",
        "description": "A chrome extensions needs to be developed. It will have  to support google login. There are essentially two screens in the extension.\nScreen 1 - If the user isn't logged in then a login with google prompt needs to be shown\n\nScreen 2 - When the user is logged in, two textboxes and a dropdown with a CTA will be shown.\nOn clicking the CTA the data from one of the textboxes need to be sent to an api and the response must be added to the other textbox.\nAnd when the api is being processed, all the elements in the UI need to be disabled.\nThe backend api will be provided.\nAlso, design is paramount here, there will be design feedback which  will need to be implemented.\n\nAcceptance Criteria\nAll the mentioned cases need to pass and the chrome extensions needs to be published to the store successfully.",
        "author": "mahendranaik",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@mahendranaik/chrome-extension-wit?t="
    },
    {
        "index": "45",
        "price": "$45.00",
        "due_days": "due in 6 days",
        "title": "Build a very simple UI and host a model which is available in collab (details of colab provided))",
        "description": "I have a Google Colab project that utilizes Python code to perform transcription with OpenAI Whisper. I want to hosted  and create a custom UI .\n\nUI will be  very simple with just a text box and some text area\n\nAcceptance Criteria\n\nWorking UI and with model api's\n\nTechnical Details",
        "author": "KishoreShimiker",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@KishoreShimiker/build-a-very-simple?t="
    },
    {
        "index": "46",
        "price": "$99.90",
        "due_days": "due in 3 days",
        "title": "Trip Advisor Review Counter",
        "description": "I need to automate the process of counting trip advisor reviews posted to a certain account.  I also need to have the quality of the review recorded.  I need the reviews & quality score to be input into a google sheet.  I need this to happen daily.\n\nAcceptance Criteria\n\nTechnical Details",
        "author": "JonathanMurrell",
        "posted_time": "11 hours ago",
        "link": "https://replit.com/bounties/@JonathanMurrell/trip-advisor-review?t="
    },
    {
        "index": "47",
        "price": "$45.00",
        "due_days": "due in 3 days",
        "title": "openai Whisper x Figma plugin bug - need some help",
        "description": "We are creating a figma plugin TypeScript app that is using open.ai's Whisper - the goal is to let users control figma with voice commands. I am having some issues with jetpack compiling everything using the watch command.\n\nIf it works out well, long-term work potential.\n\nAcceptance Criteria\nI can run the plugin on local env and have the app create a rectangle on the canvas when whisper transcribes \"create rectangle\" from my voice.\n\nTechnical Details\nBoilerplate Figma app plugin for \"design\" and \"run once\"\nTypeScript\nopen.ai (whisper api)\n\nLink to Project",
        "author": "dillonaux",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@dillonaux/openai-whisper-x-fig?t="
    },
    {
        "index": "48",
        "price": "$900.00",
        "due_days": "due in 6 days",
        "title": "Full stack dev needed for Scheduling & Booking feature ",
        "description": "Noodle is a platform for experts to sell their expertise in the form of chat or in person sessions.\n\nAs part of selling in person sessions, experts need the ability to set their availability.\n\nWe need you to build the UI (design provided) that allows an expert to write daily availability blocks to a Noodle availability endpoint.\n\nAcceptance Criteria\nAvailability UI - Webpage & components built per the design that allows an expert to create available time blocks.\n\nCreation of availability blocks - an expert should be able to create multiple availability time blocks per day and write them to Noodle. They should be able to delete availability time blocks as well.\n\nTechnical Details\nFrontend - React, Typescript, Next.js\nBackend - Node.js, Express\nDatabase - Postgres, TypeORM",
        "author": "noodleshopsinc",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@noodleshopsinc/full-stack-dev-neede?t="
    },
    {
        "index": "49",
        "price": "$180.00",
        "due_days": "due in 25 days",
        "title": "Bounties Pack - Roam Research Extension & HackerNews Site Template",
        "description": "Roam Research Extension and HackerNews Site Template\n\nAcceptance Criteria\nOwed to @TechPandaPro",
        "author": "lopezhoracio",
        "posted_time": "1 hour ago",
        "link": "https://replit.com/bounties/@lopezhoracio/bounties-pack-roam-r?t="
    },
    {
        "index": "50",
        "price": "$10.00",
        "due_days": "due in 12 days",
        "title": "🐥 Twitter Like Follower [NoCode/LowCode]",
        "description": "TLDR: Looking for the ability to follow a users likes on Twitter.\nE.g. UserX likes 1,000 Tweets, they should show up in my feed beside other Tweets.\n\nThis will be a challenge and will need some fiddling with settings. (Not 100% sure it's possible.)\nI think a hint may be in playing around with some of these settings:\na) ActivityTweet\nb) RankedOrganicTweet\nc) suggestactivitytweet\nd) suggest_activity\ne) suggestedrecycledtweet_inline\nf) suggestedgroupedtweet_hashtag\ng) suggestpyletweet\nh) suggestedrankorganic_tweet\ni) suggestrankedtimeline_tweet\nj) suggestrecycledtweet\nk) suggestsctweet\nl) suggest_recap\nm) suggestwhoto_follow\nn) genericactivityHighlights\n\nThere are various guides that summarise how to mute certain features, one of which is displaying the 'User X liked this' on your feed.\nTheoretically, there should be a way to increase the amount of likes shown in your feed by 1 specific user.\n\nThis could look like:\n-Using the Topics feature to 'Follow' some sort of [Us...",
        "author": "Bandos1000",
        "posted_time": "12 hours ago",
        "link": "https://replit.com/bounties/@Bandos1000/twitter-like-followe?t="
    },
    {
        "index": "51",
        "price": "$200.00",
        "due_days": "due in 24 days",
        "title": "Bounties Pack - Roam Research Extension & HackerNews Site Template",
        "description": "Roam Research Extension and HackerNews Site Template\n\nAcceptance Criteria\nOwed to @TechPandaPro",
        "author": "lopezhoracio",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@lopezhoracio/bounties-pack-roam-r-1?t="
    },
    {
        "index": "52",
        "price": "$0.90",
        "due_days": "closed",
        "title": "Bug: Interactive REPL",
        "description": "Just a little help with my code",
        "author": "hdbu",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@hdbu/bug-interactive-repl?t="
    },
    {
        "index": "53",
        "price": "$0.90",
        "due_days": "closed",
        "title": "Bug: JavaScript Bug",
        "description": "There is a bug in the JavaScript code on our website that is causing a specific feature to not function properly. We need someone to find and fix this bug.\n\nAcceptance Criteria\n\nThe JavaScript bug causing the feature to not function properly is fixed\nThe feature functions as expected after the fix has been implemented\nThe fix does not cause any other issues or break any other parts of the website\nThe fix is well-documented and easy to understand",
        "author": "hdbu",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@hdbu/bug-javascript-bug?t="
    },
    {
        "index": "54",
        "price": "$90.00",
        "due_days": "due in 6 days",
        "title": "Parse a Structured PDF report.",
        "description": "Our users have to digest a long PDF data report to extract a few pieces of information and make simple addition calculations to complete another task.  We have a Bubble application that utilizes Xano database where the users currently upload and store this pdf report, open it, read it, find the relevant fields, make the manual calculations and then complete their task.  This program should parse and provide the relevant fields as well as the calculated fields.\n\nSample PDF:\nhttps://drive.google.com/file/d/1BDwaWXlWF7Yz0LeI3kpE4sBKJnFEV_9T/view?usp=sharing\n\nAcceptance Criteria\nThe program should have an api to receive the report from Bubble, parse the data and store it in a way that individual fields can be called, and an api to return the needed fields to Bubble.",
        "author": "FrankieSoriano",
        "posted_time": "12 hours ago",
        "link": "https://replit.com/bounties/@FrankieSoriano/parse-a-structured-p?t="
    },
    {
        "index": "55",
        "price": "$19.80",
        "due_days": "due in 8 days",
        "title": "Virtual Muslim Prayer App",
        "description": "Here is a brief outline of how the app could work:\n\nThe user selects their current location or enters a custom location.\nThe app displays the current local prayer times and the names of the prayers (Fajr, Dhuhr, Asr, Maghrib, Isha).\nThe user can choose to join a virtual prayer session with other users or pray individually.\nIf the user chooses to join a virtual prayer session, the app shows a list of nearby mosques and their prayer times. The user can select a mosque to join the prayer session at the designated time.\nIf the user chooses to pray individually, they can select a prayer from the list and the app will provide an audio recording of the prayer in Arabic with English translation.\nThe app also includes a feature to set reminders for the daily prayer times.\n\nAcceptance Criteria\nThe app should have a functional sign up and login system\nThe app should accurately display the Qibla direction for the user's location\nThe app should display a Hadith or Quranic verse ...",
        "author": "Sarfrazkhan18",
        "posted_time": "12 hours ago",
        "link": "https://replit.com/bounties/@Sarfrazkhan18/virtual-muslim-praye?t="
    },
    {
        "index": "56",
        "price": "$180.00",
        "due_days": "due in 13 days",
        "title": "Create a Sign-in Component",
        "description": "Business Value\nI want a sign-in component that allows users to connect to my platform using different authentication methods.\n\nAcceptance Criteria\n\nAC0: The sign-in in the component must be done in the front-end using React and in the backend with Python (ideally using Django)\nAC1: The sign-in displays three different authentication methods:\nSocial login using Twitter, Google, and Apple\nPasswordless email\nConnect Wallet (Metamask, Coinbase Wallet, Wallet Connect)\n\nAC2: Given a user authenticates for the first time (so registering) using the Social Login, or passwordless email, then a wallet is created using a custodial wallet API (will define and give Access to the API to create this wallet)\nAC3:  The exact authentication flow will be sent as a Figjam draw in Discord\nAC4: The UI/UX will be sent as a Figma Prototype in Discord",
        "author": "AlexR71",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@AlexR71/create-a-sign-in-com?t="
    },
    {
        "index": "57",
        "price": "$99.00",
        "due_days": "due in 3 days",
        "title": "Improvements to Spelling Bee with Friends Game",
        "description": "Link to Project\nhttps://replit.com/@lakshman111/Spelling-Bee\nThis project allows users who like playing the NYT Spelling Bee game to play it with friends.\n\nLanguages used (and that you will need to know how to use)\nFrontend is in HTML/CSS/Javascript\nBackend is in Python\n\nAcceptance Criteria\nOn the /play page (LINK TO NEW DESIGN: https://share.balsamiq.com/c/cTJVo8rZgDm35giaPQ717a.png), change the “Share” button into a block below the game (the below is inspired from: https://wordplay.com/challenge/new).  I will refer to this as the “Challenge Box”.\n  Line 1 text: Challenge your friends to beat your score:\n  Line 2 text: https://spelling-bee.icemastereric.repl.co/play?id=64\n  Button: “Copy Link To Clipboard” (filled in as the primary button in green).  On click, change the button into “Copied”.  Change back to “Copy Link to Clipboard” after 3 seconds (Loom example showing this animation: https://www.loom.com/share/0bf3e84b5258419cacd8475686d33cfe)\nOn the /play page, below the “Challenge...",
        "author": "lakshman111",
        "posted_time": "11 hours ago",
        "link": "https://replit.com/bounties/@lakshman111/improvements-to-spel?t="
    },
    {
        "index": "58",
        "price": "$153.00",
        "due_days": "due in 13 days",
        "title": "Amazon product reviews summary",
        "description": "I am planning to see how we can apply OpenAI for say better understanding the voice of a customer and reduce my time to read through myriad of reviews on Amazon.  I need working code and UI based in Python with a simple input interface.\n\nAcceptance Criteria\nA. Create a simple page where the user adds an Amazon product detail page URL as the input. The URL will be in a format such as https://www.amazon.com/dp/B08NG8WFX5/ where B08NG8WFX5 is the product (called \"ASIN\").\nB. From this ASIN, scrap all of Amazon's reviews. Reviews can be found on a separate page such as https://www.amazon.com/product-reviews/B08NG8WFX5/.\nC. Use OpenAI to analyze the reviews.\nD. Summarize the reviews in a specified word length, input by the user (e.g., 200 words or even 20 words).\nE. Summarize reviews in specific groups with strengths and weaknesses.",
        "author": "mskreplit",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@mskreplit/amazon-product-revie?t="
    },
    {
        "index": "59",
        "price": "$45.00",
        "due_days": "due in 7 days",
        "title": "Pulling some data using simfin api",
        "description": "I need someone to use the simfin.com API to create a backtesting app for suggested portfolios. E.g., I can set conditions (P/E lower than 10, and FCF higher than $500m etc), set a date (10th of March 2018), and be able to get a list of stocks + their purchase prices. For extra credit I'd love for the purchase basket (all the stocks defined above) to be rebalanced at defined intervals (monthly/ quarterly/ yearly) if chosen.\n\nAcceptance Criteria\nAbility to input the defined criteria as above and get a table with the results.",
        "author": "strangeloopcanon",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@strangeloopcanon/pulling-some-data-us?t="
    },
    {
        "index": "60",
        "price": "$20.07",
        "due_days": "due in 13 days",
        "title": "Enhance Excel Formula Generation App with Authentication, Signing, and Pricing Features with NodeJS",
        "description": "We are looking for a developer to enhance an existing Excel formula generation app with the following features:\n\nAuthentication: Allow users to log in to the app using their Replit or Google accounts.\nSigning: Allow users to sign in to the app using their accounts.\nPricing: Implement a paywall for advanced formula generation tasks, with the option to purchase credits to use the app.In addition to these features, we would like to train the app to generate formulas for more complex prompts, using the best available OpenAI model. My previous devwloper has left enough room to competw this work.\n\nAcceptance Criteria\nTo qualify for this bounty, you should have experience working with the OpenAI API and implementing authentication and pricing features in web applications.",
        "author": "Sarfrazkhan18",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@Sarfrazkhan18/enhance-excel-formul?t="
    },
    {
        "index": "61",
        "price": "$1.80",
        "due_days": "due in 3 days",
        "title": "Data Entry in Form",
        "description": "I need someone to take some data from websites I will provide and enter it into a form, for a language learning app.\n\nNo need to know the language or any coding experience, I just need a large amount of words around 400-500 words copy pasted",
        "author": "CoderGautamYT",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@CoderGautamYT/data-entry-in-form?t="
    },
    {
        "index": "62",
        "price": "$4.50",
        "due_days": "due in 13 days",
        "title": "telegram marketing  auto add member to group. atuo send msg",
        "description": "Describe the problem you are trying to solve here.\nhere is my code :https://replit.com/@carterwu768210/addmember-telegram#main.py\nhi , i add telegtam sessions to login accounts\nthen i wanna use each account to add members from source group to target group.\nproblem is when i use server IP loop logining too many times . i got error\n\"2023-01-06 13:57:36.182 INFO mtprotosender - _disconnect: Disconnection from 149.154.175.53:443/TcpFull complete!\"\nit means that ,telegram doesn't accept loop login and auto logout all my sessions\n\nAcceptance Criteria\nBe specific about what you want in the solution here.\ni wanna someone to help me to slove this problems ,maybe with porxy.\ni have saw other people who is able to add 2000 members in one group easy , so there must be a solution\nthe add member function is at main.py\ninit .py  i dont use . because i bought all accounts they offer sessions already.\nget_members.py  it help to creat the json in data .so that  main.py can read the j...",
        "author": "carterwu768210",
        "posted_time": "16 minutes ago",
        "link": "https://replit.com/bounties/@carterwu768210/telegram-marketing-a?t="
    },
    {
        "index": "63",
        "price": "$8.00",
        "due_days": "due in 1 month",
        "title": "Making A Game Site Template",
        "description": "I Need A Site Template For Games That Makes It Easier For People To Work On With Minimal To No Coding Experience. I Also Want It To Be Customed. (Like If Someone Forks It And Changes It, It Still Says Like Part Of So And So)\nAcceptance Criteria\nSkilled IN CSS, HTML and Other Languages.\nTechnical Details\nTo Be Discussed\nTimelines / Milestones\nNo Timeline But Trying To Get Done As Soon As Possible",
        "author": "UkeBoi",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@UkeBoi/making-a-game-site-t?t="
    },
    {
        "index": "64",
        "price": "$45.00",
        "due_days": "due in 6 days",
        "title": "Use Slack API to add Titles to everyone in workspace",
        "description": "I have a Slack workspace with 300+ people, but not everyone has included their Title and Company which is less useful for the community. I want to use the Slack API to fill out this info for them. I'd like to be able to give you a CSV with everyone's info and then have this info get added to our Slack workspace.\n\nAcceptance Criteria\nA script that successfully takes a CSV and adds this information to the appropriate fields on each person's profile in a Slack workspace.\n\nTechnical Details\nWill need to use the Slack API\n\nLink to Project",
        "author": "DaysiGomez",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@DaysiGomez/use-slack-api-to-add?t="
    },
    {
        "index": "65",
        "price": "$67.50",
        "due_days": "due in 30 days",
        "title": "MVP web app for students to submit screen/webcam recordings of flashcard reviews",
        "description": "We'd like to create a basic web app that allows teachers to create sets of 2-sided digital \"flashcards\" and assign them to students; and then allows students to submit a combination screen recording/webcam recording of themselves reviewing the flashcards. The recording should show both what the student is seeing on the screen as the student navigates through the cards (click on a card to show the other side; then click a button to see the next card); and also the student's webcam view as he/she states the answers to questions out loud.\n\nAcceptance Criteria\nAccount creation for teachers (who can create flashcards)\nAccount creation for students (who can view flashcards)\nAbility of teachers to assign a set of flashcards to a student\nAbility of students to see the assignment\nAbility of students to record a flashcard review and submit it to teacher\nNotification for teachers when an assignment is submitted\nWhatever infrastructure is needed to support video storage\n\nFor th...",
        "author": "MichaelRegnier",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@MichaelRegnier/mvp-web-app-for-stud?t="
    },
    {
        "index": "66",
        "price": "$360.00",
        "due_days": "due in 2 months",
        "title": "Project Medici, the ultimate AI tool for Founders and their Team to make them Superhuman",
        "description": "Looking to utilize OpenAI's API to create an AI//JARVIS assistant to optimize founders, employees, and Users' day-to-day professional lives. Think of Project Medici as the ultimate right-hand person who can make a User do more with less based on the Users professional objectives and goals which are aligned with the overall company mission, values, and vision. Project Medici can guide, recommend and aide the user in any type of work decision or item to work on to reach their professional goals.\n\nStory 1 (Weeks 1 & 2)\n● As a user [User type: Founder], I am able to onboard by directly talking with Project Medici’s chat.\n● I am able to set/map my business, my team members, and each member’s\nroles/responsibilities.\n● I am able to answer Project Medici’s “calibration” questions which then creates a high-level “profile” of my business, of which Project Medici will use to best understand my company and understand its hierarchy and to perfect its mapping.\n● I am able to upload my company’s corp...",
        "author": "JOkun1",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@JOkun1/project-medici-the-u?t="
    },
    {
        "index": "67",
        "price": "$18.00",
        "due_days": "due in 4 days",
        "title": "Break down a project scope of work into specific coding tasks, languages and deliverables ",
        "description": "I need help to provide detailed explanations on the programming steps needed to create the project in our SOW. (Will be provided from Notion read-only link)\n\nAcceptance Criteria\nConfident can provide detailed description of steps needed to complete the 3 Phases (design, features & functionality, deployment). Include all languages, systems, libraries, number of programmers and likely timeframe.\nExperience in Project Management\nKnows requirements for WebFlow (Front-end designs), Metamask integrations (Crypto/NFTs integrations) & BackEnd gaming engine design.",
        "author": "marcandreranger",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@marcandreranger/break-down-a-project?t="
    },
    {
        "index": "68",
        "price": "$45.00",
        "due_days": "due in 2 days",
        "title": "Find 'like' text concepts in documents using OpenAI  Completion API called by Python",
        "description": "Given a text snippet of between 10 and 200 words AND a few .txt documents, write Python code to use OpenAI's Text Completion AI to search the .txt documents for concepts or snippets that are 'like' the ones supplied as label examples (if any can be found in these documents)\nInterface should look similar to the below (creating the right prompt is the key, I think - how to include both the snippets and .txt docs as part of the prompt is perhaps the tricky part - but I haven't yet tried)\n\nresponse = openai.Completion.create(\n  model = \"text-davinci-003\",\n  prompt = prompt,\n  temperature = .1,\n  max_tokens = 800,\n  top_p = 1,\n  frequency_penalty = 0,\n  presence_penalty = 0\n)\n\nLink to Project",
        "author": "YorkvilleDS",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@YorkvilleDS/find-like-text-conce?t="
    },
    {
        "index": "69",
        "price": "$450.00",
        "due_days": "due in 12 days",
        "title": "GPT-3 Chatbot For Tech Support",
        "description": "I'm looking for someone to build a GPT-3 chatbot that can answer everyday questions about technology. The chatbot should be accessible through the web and by texting a phone number.\n\nAcceptance Criteria\nChatbot should be able to maintain context of last N messages and answer basic tech questions in a simple, friendly manner\nChatbot should be accessible by texting a specified number\nChatbot should be accessible by through a web-based interface that mimics the UI/UX of a text conversation\n\nTechnical Details\nChatbot should be powered by GPT-3\nBackend should be built in Node.js\nText conversations should go through an existing OpenPhone number\nWebsite should be built in React",
        "author": "incompl",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@incompl/gpt-3-chatbot-for-te?t="
    },
    {
        "index": "70",
        "price": "$90.00",
        "due_days": "due in 5 days",
        "title": "Website that creates documents, Google authentication",
        "description": "user should be able to login via Google authentication. Submit a form with text input. Generate a word document using user input. App should be able to manage documents\n\nAcceptance Criteria\nFull completion\n\nTechnical Details\ngoogle auth\nopen to any dev language\n\nTimelines / Milestones\npayment of full completion.\ndue within one week",
        "author": "BrandonF7",
        "posted_time": "23 hours ago",
        "link": "https://replit.com/bounties/@BrandonF7/website-that-creates?t="
    },
    {
        "index": "71",
        "price": "$18.00",
        "due_days": "due in 12 days",
        "title": "twitter bot using GPT3 and AI",
        "description": "help me create a twitter bot using openAI API\n\ncontact me for more details\n\nshould be relatively simple",
        "author": "nathanpratt2",
        "posted_time": "24 hours ago",
        "link": "https://replit.com/bounties/@nathanpratt2/twitter-bot-using-gp?t="
    },
    {
        "index": "72",
        "price": "$180.00",
        "due_days": "due in 2 days",
        "title": "Tweet Search - PostgreSQL, Pinecone, OpenAI",
        "description": "Write code that lets me upload a CSV file filled with tweets and names --> creates a psql database with two columns 'tweets' and 'names'.\n\nThen pass the data through OpenAIs latest embeddings model to generate a series of vectors and store those vectors in a Pinecone Index.\n\nThen let me perform a text search over these vectors and show me the 5 most relevant tweets --> then send those tweets back into a separate psql db.\n\nAcceptance Criteria\n\nTechnical Details\nPostgreSQL\nPython\nPinecone\nOpenAI\n\nLink to Project",
        "author": "AshPrabaker1",
        "posted_time": "1 day ago",
        "link": "https://replit.com/bounties/@AshPrabaker1/tweet-search-postgre?t="
    },
    {
        "index": "73",
        "price": "$21.60",
        "due_days": "due in 12 days",
        "title": "Basic Chat App using Supabase",
        "description": "I want to build in chat to my web games. I can use socket.io which is okay, but I want to experiment with using Supabase for chat.\n\nAcceptance Criteria\nI want a simple vanilla HTML, CSS, JS application - no frameworks.\nno python, rust, non JS frameworks on back end.\nLog in via supabase auth.\nPresent a list of public rooms or create a new room\nUpdate your username and save to supabase\nJoin a room and chat\nLeave a room and join + create another\nLog out / log in - your username is preserved\nkeep session so if you reload page you are still logged in / out\ncode is Node.js based\ncode is simple to understand and reasonably documented\ncode must be your own and not copied from another project\nrights to code transfer to me upon completion of bounty - however you will be credited if the code is used in a public project\nyou must use Supabase as the instant messaging system\n\nNice to haves:\nrate limiting on messages\nadmin block / remove / ban users\nmobile friendly\nnice UI",
        "author": "triptych",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@triptych/basic-chat-app-using?t="
    },
    {
        "index": "74",
        "price": "$180.00",
        "due_days": "due in 3 days",
        "title": "Write script to download files from https://tour.carta.com",
        "description": "I need a script that uses a headless browser (please use playwright and not selenium or puppeteer) to do the following:\n\nLog in to https://tour.carta.com as a Company Administrator.\nDownload every file for a specific company (an example company in the tour is Meetly).\nSave the files to a zip file that the user of the script can download.\n\nThis is the list of places where you'll find files to download:\n\nCompany > Library (https://tour.carta.team/corporations/7/library/)\nCompany > Data Rooms (https://tour.carta.team/data-rooms/7/#/)\nSecurities > All different types (Shares, Equity Awards, Warrants, Convertibles) > Click individual securities to open the modal > Click \"Documents and notes\" > Download those files\nSecurities > Templates > Document Sets\n\nBe aware that under a section like Securities > Equity Awards there can be multiple tabs (Options, RSAs, RSUs, SARs, CBUs, Profit Interests), so you'll need to visit each of those tabs and download the files for all thos...",
        "author": "AdsoVonMelk",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@AdsoVonMelk/write-script-to-down?t="
    },
    {
        "index": "75",
        "price": "$0.90",
        "due_days": "closed",
        "title": " Anything :  threejs, js, html, css, socket io, and p5js ",
        "description": "Anything you want me to create within my knowledge I am willing to complete or attempt. I am always  down for a challenge.",
        "author": "JumaAboke",
        "posted_time": "16 hours ago",
        "link": "https://replit.com/bounties/@JumaAboke/anything-threejs-js?t="
    },
    {
        "index": "76",
        "price": "$0.90",
        "due_days": "closed",
        "title": "Bug: Website Login Feature",
        "description": "We are experiencing an issue with our website's login feature. When users try to log in, they are receiving an error message saying that their login credentials are incorrect, even when they are entering the correct information. We need someone to identify the cause of this issue and fix it.\n\nAcceptance Criteria\n\nThe login feature is functional and allows users to log in with the correct credentials\nThe error message no longer appears when users enter correct login credentials\nThe fix does not cause any other issues or break any other parts of the website\nThe fix is well-documented and easy to understand",
        "author": "hdbu",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@hdbu/bug-website-login-fe?t="
    },
    {
        "index": "77",
        "price": "$90.00",
        "due_days": "due in 13 days",
        "title": "AI-Powered Chatbot Trained on the content of my blog",
        "description": "Enable users to get any answers based on the content within the blog. The ChatBot needs to be fine-tuned on the content of the blog.\n\nAcceptance Criteria\nThe main goal is to create a business bot that is able to provide any business-related answer, leveraging GPT-3 and fine-tuning the content on a blog.",
        "author": "GennaroCuofano",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@GennaroCuofano/ai-powered-chatbot-t?t="
    },
    {
        "index": "78",
        "price": "$2.70",
        "due_days": "closed",
        "title": "Create script to upload multiple files in site",
        "description": "I have a site on which I can upload one file at a time through a modal/api.\n\nI would like to create a script on the client side which can upload multiple files the same way. It can be a simple script I can run on the browser Console, or a chrome extension.",
        "author": "CoderGautamYT",
        "posted_time": "16 hours ago",
        "link": "https://replit.com/bounties/@CoderGautamYT/create-script-to-upl?t="
    },
    {
        "index": "79",
        "price": "$900.00",
        "due_days": "due in 3 months",
        "title": "ActivityPub Integration with Minds",
        "description": "Minds is looking to support ActivityPub in a similar level to Pleroma or Mastodon in order to join the fediverse. Some initial work has been started, which may or may not be helpful.\n\nAcceptance Criteria\n\nMust work in Chrome, Firefox, Safari including mobile web\nMust include near equivalent ActivityPub functionality to Mastodon\nMust reuse as many existing design components as possible and coordinate with Minds team to approve designs and implementation strategy\n\nTechnical Details\n\nhttps://developers.minds.com\n\nLink to Project\n\nhttps://gitlab.com/minds/minds/-/issues/90",
        "author": "mindsorg",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@mindsorg/activitypub-integrat?t="
    },
    {
        "index": "80",
        "price": "$0.90",
        "due_days": "due in 12 days",
        "title": "[Discord bot] [Less than 3 minutes] Add a footer to bot",
        "description": "I need someone to add a footer to my discord bots embed and set the bots about me!\nAcceptance Criteria\nMust have a discord account in the application or linked to your replit account\n\nMUST KNOW DISCOR.JS",
        "author": "OddGames",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@OddGames/discord-bot-less-tha?t="
    },
    {
        "index": "81",
        "price": "$9.00",
        "due_days": "closed",
        "title": "Python + Playwright Cron in Docker Container",
        "description": "I need a Docker container that runs a python script to execute playwright. The docker container should run a cron job inside to run the python script every 5 minutes.\n\nAcceptance Criteria\nA Python script that loads a webpage using Playwright. No logic needs to be executed on the page.\nA Dockerfile to run the python script in a container. It should also run a cron inside the container to run the python script every 5 minutes",
        "author": "oAkeDCH",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@oAkeDCH/python-playwright-cr?t="
    },
    {
        "index": "82",
        "price": "$108.00",
        "due_days": "due in 2 days",
        "title": "aws cross account access for users federated via  azure AD ",
        "description": "as a federated user who is authenticated via sso with 2FA enabled i need to be able to switch between aws accounts within an aws organization.\n\ne.g. a federated user needs to assume role A in master payer account (account #1) and role B sub-account (account #2).\n\nAcceptance Criteria\ntrust relationships must be defined (or checked) between role A and role B\nuser does not have to assume a role via the cli; federated user in question can swap back and forth between role A and role B\nscript can be run locally, or from within the sub account (account #2)\n\nTechnical Details\nusers are authenticated via sso through azure active directory\n2FA through duo\nrole A in account #1 is responsible for collecting data across sub accounts; it is read only\nrole B in account #2 will be responsible for running the script;\norder of operations: federated user (or an application) assumes role B, role B assumes role A, role A gathers all necessary data, federated user (or an application) ass...",
        "author": "xxyjoel",
        "posted_time": "16 hours ago",
        "link": "https://replit.com/bounties/@xxyjoel/aws-cross-account-ac?t="
    },
    {
        "index": "83",
        "price": "$0.90",
        "due_days": "closed",
        "title": "Bug: Mobile Version unstable",
        "description": "There is a bug in the mobile version of our website that is causing the layout to break and certain elements to overlap. This issue is only present on mobile devices and does not occur on desktop. We need someone to identify and fix this bug.\n\nAcceptance Criteria\n\nThe layout of the mobile version of the website is correct and all elements are displayed properly\nThe overlap issue is resolved\nThe fix does not cause any other issues or break any other parts of the mobile website\nThe fix is well-documented and easy to understand",
        "author": "hdbu",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@hdbu/bug-mobile-version-u?t="
    },
    {
        "index": "84",
        "price": "$180.00",
        "due_days": "due in 5 days",
        "title": "Event Selection Web Service",
        "description": "web application where users can create an event. When event(10 day event) is created users can choose from two options. One, daily email. Second, calendar invite with ten consecutive days. Free users get access to limited list of events. Paid users get access to all events. Collect information on what they want to learn from event. When event is created user can share social media (twitter/Facebook) that they started an event. When event has completed user can share on social media that they completed event.\n\nAcceptance Criteria\nall webpages and backend verified\n\nTechnical Details\nlanding page\ngoogle authentication\nstripe integration\nevents page (two sections; free and paid)\nevent details page - collects information about user (goal of event)\nuser dashboard - lists in progress events\nmanagement page to create/edit/delete events (title and description)\n\nTimelines / Milestones\none week",
        "author": "BrandonF7",
        "posted_time": "16 hours ago",
        "link": "https://replit.com/bounties/@BrandonF7/event-selection-web?t="
    },
    {
        "index": "85",
        "price": "$0.90",
        "due_days": "closed",
        "title": "Feature: Delete Message",
        "description": "I've implemented this feature already, just need a quick fix.",
        "author": "hdbu",
        "posted_time": "16 hours ago",
        "link": "https://replit.com/bounties/@hdbu/feature-delete-messa?t="
    },
    {
        "index": "86",
        "price": "$27.00",
        "due_days": "due in 12 days",
        "title": "Sawtooth Marketplace Example",
        "description": "Get this public archive to run on a private Repl\nAcceptance Criteria\n      Can run this example with simple instructions\nTechnical Details\n     I prefer to work in Python and will use this example to build further using the Python SDK\nLink to Project\nhttps://github.com/hyperledger/sawtooth-marketplace",
        "author": "SamuelSlusher",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@SamuelSlusher/sawtooth-marketplace?t="
    },
    {
        "index": "87",
        "price": "$270.00",
        "due_days": "due in 12 days",
        "title": "CryptPad Calendar Telegram Bot",
        "description": "Currently using CryptPad Calendar. Need it connected to a Telegram Bot (2-Way Messaging)\n\nAcceptance Criteria\nThree key features:\n\nDaily Push of {Today} Calendar, including notes within an event (Receive)\nPre-event alert {1h} for all events (Receive)\nCreate Calendar Event from Telegram (Send)\n\nDocs\nCryptPad: https://docs.cryptpad.org/en/\nTG: https://core.telegram.org/bots/api",
        "author": "hyperion335",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@hyperion335/cryptpad-calendar-te?t="
    },
    {
        "index": "88",
        "price": "$0.90",
        "due_days": "due in 3 days",
        "title": "Help with canvas [JAVASCRIPT]",
        "description": "I need some help wih a veerrrt simple thing about js canvas. bekos I am stopiv.\nYou csn earn some free cycles!\n\nGoofy ah typo!",
        "author": "MNA4",
        "posted_time": "12 hours ago",
        "link": "https://replit.com/bounties/@MNA4/help-with-canvas-jav?t="
    },
    {
        "index": "89",
        "price": "$4.50",
        "due_days": "closed",
        "title": "Need Server Mass DM Tool Discord ",
        "description": "Need full custom discord mass dm tool. Paying 500 Cycles for that or maybe more!",
        "author": "ItsLmn5555",
        "posted_time": "12 hours ago",
        "link": "https://replit.com/bounties/@ItsLmn5555/need-server-mass-dm?t="
    },
    {
        "index": "90",
        "price": "$4.50",
        "due_days": "closed",
        "title": "Mass Bot Adder Discord Tool",
        "description": "Need custom mass bot adder in server tool. Which can add bot to server by solving hCaptcha automatically!",
        "author": "ItsLmn5555",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@ItsLmn5555/mass-bot-adder-disco?t="
    },
    {
        "index": "91",
        "price": "$0.90",
        "due_days": "closed",
        "title": "Bug: Shopping Cart",
        "description": "There is a bug in the shopping cart feature of our website that is causing the item quantities to not update correctly. When a user increases the quantity of an item in their cart, the total price does not update to reflect the change. We need someone to find and fix this bug.\n\nAcceptance Criteria\n\nThe item quantities in the shopping cart update correctly and the total price reflects the changes\nThe fix does not cause any other issues or break any other parts of the shopping cart feature\nThe fix is well-documented and easy to understand",
        "author": "hdbu",
        "posted_time": "12 hours ago",
        "link": "https://replit.com/bounties/@hdbu/bug-shopping-cart?t="
    },
    {
        "index": "92",
        "price": "$10.80",
        "due_days": "due in 13 days",
        "title": "CarGurus Webscraper",
        "description": "Trying to learn web scraping.  Want someone to build code (in python) for a scraper that  grabs and saves the model, year, miles, location and price of a specific car model on Cargurus and saves it to a replitdb.  Also want it to print same data to the console.  Should be able to scrape across multiple pages.\n\nThink it is pretty quick if you know beautifulsoup and maybe selenium.  Agnostic on what libraries you use.  Still figuring it out and will learn faster if I can see it done correctly.  Thanks!",
        "author": "mbeek",
        "posted_time": "12 hours ago",
        "link": "https://replit.com/bounties/@mbeek/cargurus-webscraper?t="
    },
    {
        "index": "93",
        "price": "$182.70",
        "due_days": "due in 3 months",
        "title": "Fictional web shop",
        "description": "This is an art project. I want a beautiful looking website where people can list fictional products and interact with fictional products in the hope that someone shall create the products.\n\nAcceptance Criteria\n\nUsers can register, sign in.\nUsers can create a listing which has a title, price and a free text field in markdown.\nUsers can include images in the markdown description.\nUsers can comment on product\nUsers can leave fictional reviews\nUsers can create product specification table in markdown\n\nFor ideas, see Kickstarter",
        "author": "Chronological",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@Chronological/fictional-web-shop?t="
    },
    {
        "index": "94",
        "price": "$45.00",
        "due_days": "due in 5 days",
        "title": "OpenAPI Training UI",
        "description": "I want a python code with simple UI where I can upload a CSV with prompts and completions (2 columns), specify a base-model to fine tune, specify new model name, set other variables (learning rate, epochs, etc), quickly validate the file, upload to OpenAI, run OpenAI fine-tuning, follow progress along the way, and return the fine-tuned model details in the end.\n\nWhen uploading the data:\nFinish every prompt with a separator \\n\\n###\\n\\n\nFinish every completion with ending token\n\nThe relevant documentation is here: https://beta.openai.com/docs/api-reference/files/upload and here https://beta.openai.com/docs/api-reference/fine-tunes/create",
        "author": "ElieHabib",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@ElieHabib/openapi-training-ui?t="
    },
    {
        "index": "95",
        "price": "$45.00",
        "due_days": "due in 12 days",
        "title": "Deploy ML app on AWS",
        "description": "Deploy a simple ML app to AWS.  We have a Whisper AI + DeepL app that translates + transcribes YouTube videos in bulk. We're looking to deploy it to an AWS instance with GPU optimized for this type of work.\n\nAcceptance Criteria\nThe app is successfully running on AWS instance\nThe app is password protected\nThe app is accessible via domain (we will point the domain per your instructions)",
        "author": "AlexZatvor",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@AlexZatvor/deploy-ml-app-on-aws?t="
    },
    {
        "index": "96",
        "price": "$1,800.00",
        "due_days": "due in 14 days",
        "title": "App for Podcast with AI host",
        "description": "I'd like to make a web app where where a GPT-based AI bot interviews guests and produces a podcast. I believe this should be built using OpenAI's GPT-3 and Whisper models, and trained on transcripts of existing interviews, but I'm open to other approaches.\n\nAcceptance Criteria\nWebsite where someone can sign up to be interviewed\nThe Podcast bot should be able to respond to style prompts for the host - e.g. \"30 minute interview, focused on the guest's childhood; interviewer is a 45 year old male from Oklahoma with a background in education.\" or \"45 minute interview, wide ranging from sports to entertainment and popular culture; interviewer is a creative 25 year old woman from London\"\nThere should also be an ability for an admin to input those prompts, which creates a link that can be sent to a Guest to be interviewed.\nthe end product should be a finished podcast ready to be published on a podcasting platform\na full transcript should also be produced\nshow notes should ...",
        "author": "metalburritos",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@metalburritos/podcast-with-ai-host?t="
    },
    {
        "index": "97",
        "price": "$630.00",
        "due_days": "due in 12 days",
        "title": "Fake Twitter Post Creator",
        "description": "People like to laugh and poke fun of situations. What better way than memes? Well, twitter fake \"posts\" could be hilarious of used properly in meme fashion. Well... this is the app! Fake twitter post creator.\n\nAcceptance Criteria\nCreate a mini-web-app that allows users to create a Fake Twitter Post – where they can customize the handle, message, # of retweets, # of likes etc.\nThe app allows the ability to add 1 reply to the initial tweet with similar customization (e.g., message, handle, avatar, # of likes)\nThe mini-app pulls in information related to the user inputted via the Twitter API including the profile picture, name, and handle based on an inputted twitter profile\nThe look/feel and design of the fake post should mimic what is currently live on twitter, with some subtle differences in colour so that it is apparent it isn't real\nA live preview of the changes are shown to the user, with a watermark/url on the meme fake post (as users will right-click be able to...",
        "author": "jarednxx",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@jarednxx/fake-twitter-post-cr?t="
    },
    {
        "index": "98",
        "price": "$1.80",
        "due_days": "closed",
        "title": "Custom Tip Tool for Replit ",
        "description": "Looking for a Repl that allows me to easily customise my tip for a specific Repl.\n\nIdeal is just a line where I can paste a link to a Repl\nThen enter the specific amount of cycles I want to tip, then run it.\n\nLooks like it has been discussed here and would use Replit GQL: https://ask.replit.com/t/custom-tipping-cycles/4595/7?u=bandos1000\n\nAcceptance Criteria\nA Repl that allows me to custom tip (1-10,000) specific Repls.",
        "author": "Bandos1000",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@Bandos1000/custom-tip-tool-for?t="
    },
    {
        "index": "99",
        "price": "$900.00",
        "due_days": "due in 2 days",
        "title": "Chrome extension: GPT-3 based GMail completions",
        "description": "Gmail has a language-model-based completion feature, but it's fairly limited only works for sentences and doesn't compose entire emails.\n\nI want a completion tool that's more sophisticated that uses OpenAI's GPT-3.\n\nThe tools should work like the following:\nCan be triggered manually using a shortcut (say control+space)\nThe prompt sent to the model includes the email you're responding to. If the email chain is too long it needs to be truncated.\nCan complete entire emails\nThe extension can be configured with the following settings:\n  The user's OpenAI API Key\n  A custom prompt (with a default prompt as described above)\n  Model type (defaults to text-davinci-003)\n  Max Tokens returned from the model (defaults to 1024)\n  Temperature\n  Stop words with support for newlines (similar to the OpenAI playground)\n\nAcceptance Criteria\n\nThe code has to be clean and well documented\nThe UX needs to be minimal and clean:\n  Trigger the completion\n  Inline load indicator\n  Text return...",
        "author": "amasad",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@amasad/chrome-extension-gpt?t="
    },
    {
        "index": "100",
        "price": "$10.00",
        "due_days": "due in 3 days",
        "title": "🏘️Airbnb DiscountFinder Browser Extension/Overlay",
        "description": "Airbnb hosts have the option to offer weekly and monthly discounts to attract long term guests.\nHowever, there is no easy way for potential guests (End users searching airbnb) to see the percentage or amount of that discount for stays. (Some hosts offer 5% off, some hosts offer 80% off.)\nAllowing customers to see the discount while browsing will allow them to make better buying decisions. (E.g. I would rather stay in a $200 off place if I'm staying than a $15 off place, even if they are the same ending price.)\n\nCurrent State: When searching for a stay 7+ or 30+ days, Users must click into each listing to view the discount amount.\n\nIdeal State: Users can view the discount amount in the browsing card without needing to click into each listing.\n\nFigma page:\nhttps://www.figma.com/file/Z96850eOePOavYljF5G0FP/Airbnb-Discount?node-id=0%3A1&t=EY5nY1fuqAeuTIEV-1\n\nAcceptance Criteria\nAn overlay or browser extension that allows end users (not logged in) to easily see (Bonus: a...",
        "author": "Bandos1000",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@Bandos1000/airbnb-discountfinde?t="
    },
    {
        "index": "101",
        "price": "$225.00",
        "due_days": "due in 3 days",
        "title": "Create visualizations for various datasets",
        "description": "We’re building a dataset of relevant visualizations for various datasets stored in CSV format. We want someone to help accelerate this process by creating high-quality charts.\n\nAcceptance Criteria\nData visualizations use a coherent mark type (line, bar, point, arc, etc.) and display quantitative information with descriptive axis labels, appropriate scale, and readable intervals\nAt least one chart generated per CSV file in this repo, although if multiple coherent variations can be produced from a single dataset that would be preferred\nVisualizations are produced using Vega Lite (https://vega.github.io/vega-lite/)\nVisualizations must be styled well / professional-grade, you can find examples at https://vega.github.io/vega-lite/examples/\nProfit!",
        "author": "SeanDoherty6",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@SeanDoherty6/create-visualization?t="
    },
    {
        "index": "102",
        "price": "$13.70",
        "due_days": "due in 4 months",
        "title": "Follow me to get some free cycles!",
        "description": "All you have to do is follow me to get the cycles, if you are already following me, unfollow me and follow me again",
        "author": "Coder992",
        "posted_time": "14 minutes ago",
        "link": "https://replit.com/bounties/@Coder992/follow-me-to-get-som?t="
    },
    {
        "index": "103",
        "price": "$90.00",
        "due_days": "due in 12 days",
        "title": "Python script to screen scrape complete Ohio Revised Code in PDF and TXT form",
        "description": "I am looking for a python script which will do the following for both the Ohio Administrative Code and the Ohio Revised Code (the process should be the same, but the starting URL will be different).\n\n1) Go to the root URL -- https://codes.ohio.gov/ohio-revised-code or https://codes.ohio.gov/ohio-administrative-code\n2) Recursively go through each section and subsection.  For example, if you do a depth first search, the first leaf node you hit will be Ohio Revised Code/General Provisions/Chapter 1 Definitions; Rules of Construction / Section 1.01 | Revised Code - citation and designation - General Code /\n3) On the leaf node, you will find a link labeled \"Download Authenticated PDF\".  For example, for the first leaf node, the URL will be https://codes.ohio.gov/assets/laws/revised-code/authenticated/0/1/1.01/6-29-2011/1.01-6-29-2011.pdf\n4) Download the PDF to the computer\n5) convert the PDF to a txt file with the same name.  For example, you will end up with 1.01-6-29-2011.pdf and 1.01-6-2...",
        "author": "EthanArd1",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@EthanArd1/python-script-to-scr?t="
    },
    {
        "index": "104",
        "price": "$45.00",
        "due_days": "closed",
        "title": "Add a credit system to a GPT3 website.",
        "description": "I made a simple website using gpt3 to output Napoleon's opinion on anything, in french. I want to create a system where users can't use it indefinitely. They should have a limited number of free use (e.g. with a credit system), and later we can add a function allowing them to buy more credits for more demands.\n\nAcceptance Criteria\n\nIdeally, past experience in creating a credit system for website use.\n\nTechnical Details\n\nThe site is made in react js, and uses openAI API. The thing we have to lock after several uses is just the button sending the prompt. There is only one page accessible to users.\n\nLink to Project\nhttps://napoleon.dicitur.repl.co/",
        "author": "Dicitur",
        "posted_time": "16 hours ago",
        "link": "https://replit.com/bounties/@Dicitur/add-a-credit-system?t="
    },
    {
        "index": "105",
        "price": "$0.90",
        "due_days": "closed",
        "title": "Bug: Search Function",
        "description": "We are experiencing issues with the search function on our website. When users enter a search query, the results are not relevant and do not match the query. We need someone to identify the issue and fix it so that the search function returns accurate and relevant results.\n\nAcceptance Criteria\n\nThe search function returns accurate and relevant results for all queries\nThe fix does not cause any other issues or break any other parts of the website\nThe fix is well-documented and easy to understand",
        "author": "hdbu",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@hdbu/bug-search-function?t="
    },
    {
        "index": "106",
        "price": "$10.00",
        "due_days": "closed",
        "title": "Host NodeJS/Express app on Vercel",
        "description": "I have a Nodejs/Express app running as a Repl. I need someone to host it on Vercel.\n\nNote that the current app has a server, it has to be made serverless to be supported on Vercel.\n\nMust meet the deadline.",
        "author": "CoderGautamYT",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@CoderGautamYT/host-nodejsexpress-a?t="
    },
    {
        "index": "107",
        "price": "$4.59",
        "due_days": "due in 3 days",
        "title": "Add a search preview to a Chrome Extension popup",
        "description": "I have a chrome extension (V3) popup here where the users can search for a copy of an academic journal article using its title, and the extension will automatically search four sites to find a free copy of the paper. Right now the extension only display the searched URL of the four sites, but I'd like it to (1) highlight the sites where the search yielded exact matches, and (2) display preview of the entire line where there is an exact match to the title of the paper.\n\nAcceptance Criteria\n(1) Highlight the site button if the title search yielded an exact match\n(2) Display the line of the exact match from the target URL\n\nTechnical Details\nThis is a Google Chrome extension V3\n\nLink to Project\nThe codebase is open source and available here:\nhttps://github.com/Huang-lab/GetFreeCopy",
        "author": "huangk06",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@huangk06/add-a-search-preview?t="
    },
    {
        "index": "108",
        "price": "$54.00",
        "due_days": "due in 13 days",
        "title": "PDF to HTML pipeline",
        "description": "Convert PDFs to hosted HTML that I can read in Readwise Reader.\n\nAcceptance Criteria\nUse MathPix API to produce the HTML. Allow me to specify the API key. (You should have enough free quota to test out the service, but let me know if that's a problem.)\nAny hosting solution that allows public access to the HTML. GitHub pages is currently working for me.\nIdeally anyone could use the script by giving their own MathPix API key.",
        "author": "ryanmuller2",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@ryanmuller2/pdf-to-html-pipeline?t="
    },
    {
        "index": "109",
        "price": "$306.00",
        "due_days": "due in 5 days",
        "title": "EV Car Simulation",
        "description": "The Simulation\n\nWe want to create a simulation that keeps track of a fleet of 1000 electric vehicles going from a random origin to a random destination, stopping at charging stations along the way.\n\nIt'll have 3 major components, and will track some attributes for each:\n\n1. Vehicle, will have the following attributes:\n\nVehicle.VehicleIdentification.VIN\nRemains constant throughout the lifetime of the vehicle. Can be generated randomly at run-time, or set manually for each of the 1000 vehicles, with the format defined by ISO 3779.\nExample value: 4Y1SL65848Z411439\n\nVehicle.Speed\nSpeed of the vehicle can remain constant (preferable if varied, but not a requirement). If constant, should be different for each vehicle generated randomly.\nExample value: 80km/h\n\nVehicle.CurrentLocation.Latitude\nThe latitude component of the vehicle's location co-ordinates. Should update every time slice depending on the vehicle's current location.\nExample value: 52.519171\n\nVehicle.CurrentLo...",
        "author": "vibo",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@vibo/ev-car-simulation-1?t="
    },
    {
        "index": "110",
        "price": "$90.00",
        "due_days": "due in 5 days",
        "title": "Prompt to presentation ",
        "description": "Enable a user to generate a business presentation by starting with a few simple prompts.\n\nAcceptance Criteria\nA simple web app that enables users to transform prompts into business presentations.",
        "author": "GennaroCuofano",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@GennaroCuofano/prompt-to-presentati?t="
    },
    {
        "index": "111",
        "price": "$360.00",
        "due_days": "due in 10 days",
        "title": "Q&A from Table data",
        "description": "Build a Q&A answering app for Tabular data.\n\nUser should be able to upload a csv (both training and actual data for prediction) and then use the app to ask Questions and get answers.\n\nAcceptance Criteria\n\nAbility to upload CSV files\nUI to ask questions and get answers.\nWe can discuss if you have more questions\n\nTechnical Details\n\nPinecone.io sample code - https://github.com/pinecone-io/examples/blob/master/questionanswering/tableqa.ipynb\n\nuses https://github.com/google-research/tapas\n\nNext.js or any other framework for building UI",
        "author": "KishoreShimiker",
        "posted_time": "5 hours ago",
        "link": "https://replit.com/bounties/@KishoreShimiker/qanda-from-table-dat?t="
    },
    {
        "index": "112",
        "price": "$108.00",
        "due_days": "due in 5 days",
        "title": "Documentation for the digital.auto playground, both technical/non-technical parts.",
        "description": "We need documentation on how to use the digital.auto playground, including all aspects of prototypes/plugins etc.\n\nI'd like for someone to take a look at the site @ https://digitalauto-dev.netlify.app, and see what it's about. We can then do a video call where I take you through the site and all aspects of it, including the sparse documentation we have.\n\nAcceptance Criteria\n\nDocumentation on how to use the digital.auto playground, including technical/non-technical parts.\nGet started guide which demonstrates how to use the playground.\nDocs must be written with mkdocs, or an actual better alternative.",
        "author": "vibo",
        "posted_time": "7 hours ago",
        "link": "https://replit.com/bounties/@vibo/documentation-for-th?t="
    },
    {
        "index": "113",
        "price": "$180.00",
        "due_days": "due in 13 days",
        "title": "Mastadon Daily Active User Dashboard",
        "description": "Mastadon is a distributed Twitter alternative that spiked in popularity. The problem is to estimate the size of the communities on an ongoing active basis. There are thousands of servers which users can join. I believe users can be part of multiple servers. The goal is to create a basic metrics dashboard which updates daily with the number of servers being processed and the number of active users on each platform. Don't abuse servers with overly frequent or aggressive polling.\n\nAcceptance Criteria\nWebsite reflects the total daily active users on Mastadon\nAs more days pass, a graph of DAU updates\nReflect the last time the calculation was run\nThe site is open source, linking to the code that runs the site\nIdeally, the DAU for each server could be listed as well, in decreasing rank order of the top N\n\nYou maybe brand the site however you like, including promoting yourself.",
        "author": "ikirigin",
        "posted_time": "8 hours ago",
        "link": "https://replit.com/bounties/@ikirigin/mastadon-daily-activ?t="
    },
    {
        "index": "114",
        "price": "$58.50",
        "due_days": "due in 21 days",
        "title": "Make a port of my Fitbit game to Apple watches",
        "description": "I've recently made and published a game on the Fitbit appstore, called \"Fit Hunt\". It's garnered a small community of hunters, but I think the reach can be extended being ported to Apple's line of watches as Fitbit is slowly dying.\n\nI realise the amount this bounty is asking for may not seem like much, however the game's core mechanics shouldn't take more than a day and you'll have reins over the Apple section of the community.\n\nAcceptance Criteria\nI want a close-enough port of the game on Apple watches, using the same server as the Fitbit one does, with all the core functionality. I'll provide all the details to the game.\n\nHunters must:\nHave some experience with creating apps for Apple watches\nBe able to produce a version ready for publishing on the App store\nProvide the app in a few select languages, with the help of Google translate of course.",
        "author": "codingMASTER398",
        "posted_time": "8 hours ago",
        "link": "https://replit.com/bounties/@codingMASTER398/make-a-port-of-my-fi?t="
    },
    {
        "index": "115",
        "price": "$45.00",
        "due_days": "due in 4 days",
        "title": "Link shortener scraper",
        "description": "There is a link shortening website, Hoo.Be, that has a large number of creators. All creators have their pages in the format hoo.be/, e.g. https://hoo.be/ashlynclint. These pages then have a number of outbound links to the creator's pages on Instagram, etc. I would like someone to build a scraper that will scrape all pages that have a link to both Instagram and OnlyFans.\n\nAcceptance Criteria\n\nPlease provide a CSV with a row for each creator on Hoo.Be who has both an Instagram and OnlyFans.\n\nThe CSV should contain fields for:\nHoo.Be URL\nInstagram username\nInstagram URL\nInstagram avatar URL\nNumber of Instagram followers\nOnlyFans URL\nNumber of OnlyFans posts\nNumber of OnlyFans likes\n\nTechnical Details",
        "author": "NikhilGoel",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@NikhilGoel/link-shortener-scrap?t="
    },
    {
        "index": "116",
        "price": "$22.50",
        "due_days": "due in 4 days",
        "title": "Photoshop Plugin Help",
        "description": "I'm a javascript novice. Trying to make a photoshop plugin that can fetch an image from a url and add it to the current photoshop document. My plugin currently sends a request to dalle2 api and I am able to get a url, but I am unable to add image to current doc. Maybe need to generate session token? I don't know how.\n\nAcceptance Criteria\nAdd functionality to my code to get the image from the url and place it in the current open document in Photoshop\n\nTechnical Details\n\nLink to Project\nhttps://replit.com/join/wyywstdtja-profdl",
        "author": "profDL",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@profDL/photoshop-plugin-hel?t="
    },
    {
        "index": "117",
        "price": "$45.00",
        "due_days": "due in 2 days",
        "title": "Whisper Transcript GUI ",
        "description": "I need a simple App built with already a working script to transcribe using Whisper.\n\nI need there to be a GUI where it can accept a link of the podcast (can be a youtube link, a spotify link, other links for the podcast so it can be downloaded) and then have it downloaded from the link and transcribed into a .txt file with the name of the episode transcribed + \"transcription\" as the file name.\n\nI also would like the script to be done on python and in a way that I can transcribe episodes on my local computer with my 3070 GPU.\n\nAcceptance Criteria\nI need someone with a background building an easy/robust GUI on python that can easily finish this part of the script so that I can bulk transcribe episodes of podcasts just by pasting the link in the GUI.\n\n* You will not need to do any coding for the actual transcribing through whisper. I have already done that part. Just need this quick addition done.*",
        "author": "rame001",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@rame001/whisper-transcript-g?t="
    },
    {
        "index": "118",
        "price": "$90.00",
        "due_days": "due in 2 days",
        "title": "Come up with a mechanism ",
        "description": "Validate the following criteria between Repls -\n\n1) Time difference between the fork of two different repls\n2) Check to see if the main.py file is blank across different repls\n3) When given a list of Repls, check to see if the code in main.py is duplicated in any if them\n\nAcceptance Criteria\nCode should be clean, completed and commented. This is super urgent and should ideally be completed in 24 hours.",
        "author": "anshul",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@anshul/come-up-with-a-mecha?t="
    },
    {
        "index": "119",
        "price": "$45.00",
        "due_days": "due in 8 days",
        "title": "Create a simplified maxmypoint.com website clone for Hyatt hotels",
        "description": "Create a simplified version of https://maxmypoint.com/ for Hyatt hotels only. There is no need for a subscription feature or to include other hotel brands like Hilton or Marriot. There is also no need for an email alert or login feature.\n\nThe website should include a blog element for a travel and point-maximizing blog.",
        "author": "GamblingGlobeTrotter",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@GamblingGlobeTrotter/create-a-simplified?t="
    },
    {
        "index": "120",
        "price": "$360.00",
        "due_days": "due in 18 days",
        "title": "Dictation app that can transcribe text and create properly formatted reports",
        "description": "I want to create a custom dictation app that can transcribe my spoken text into a properly formatted report.\n\nI create formatted technical reports for clients in my current job, about 30-40 times a day.  I use a dictation tool that allows me to freely dictate my findings, but I have to mentally organize my thoughts for a few moments so that I can say everything in the proper sequence. Alternatively,  I can dictate the findings out of order and then spend time manually rearranging and formatting the report. I also have the ability to create basic macros with this tool, where I can say one word or phrase and it will output a pre-completed body of text. However, this macro feature is not very flexible and cannot adjust the output based on the context of the report. Lastly, the current system has no idea if it mistranscribed a word because it doesn't understand the context.\n\nThe app should be able to listen when I click dictate and continue listening even when I switch ...",
        "author": "mokal",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@mokal/dictation-app-that-c?t="
    },
    {
        "index": "121",
        "price": "$504.00",
        "due_days": "due in 12 days",
        "title": "Build website/app to recreate uploaded image into new image",
        "description": "Build a website & app where people can upload an image and create a unique AI artwork (via StableDiffusion, MidJourney, Dall-E-2 or other) and generate a new image.\n\nProblem:\nBasically, I am looking to upload a photo, then through the magic of ai, generate a new version of the person in that photo in a different scenario. Example, I upload my picture and then tell the AI to redraw me in Paris, or redraw me as a painting by Van Gogh, or cartoon me like a simpson's cartoon.\n\nAfter I upload the image, I select the criteria for my image, and AI outputs the finished product.\n\nThe user is then able to order that product in any number of formats. As a canvas, on a coffee mug, etc. I will provide the products that will be offered.\n\nUsers will need to sign up or sign in through another platform to use the site. I want the user to also be able to \"save\" the artwork they have generated to their account within the site, so that they can generate artwork at one time, then print ...",
        "author": "crillbill",
        "posted_time": "17 hours ago",
        "link": "https://replit.com/bounties/@crillbill/build-websiteapp-to?t="
    },
    {
        "index": "122",
        "price": "$450.00",
        "due_days": "due in 3 days",
        "title": "Recipe Generator Script",
        "description": "I need a python script that accepts dynamic input from users that want a recipe, and then returns a recipe for them. The input could be a recipe title (like London Broil or vegan pancakes), recipe description (spicy noodle dish), or even a list of ingredients (i have three onions, four cups of broth and a pound of chicken).\nI have API keys for spoonacular and openAI, and am willing to use both.\nAcceptance Criteria\na working python script that prints out a complete and usable recipe based on dynamic user input\nTechnical Details\njust a python script is needed for now.",
        "author": "jtmertes",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@jtmertes/recipe-generator-scr?t="
    },
    {
        "index": "123",
        "price": "$13.50",
        "due_days": "closed",
        "title": "Fix chrome extension syntax/bug.",
        "description": "I am trying to build a simple chrome extension that scraps a website profile. I have written most of the code, but have run into a bug, namely a mishap in  v2 vs v3 syntax. Should be a quick fix for anyone with experience in chrome extensions.\nAcceptance Criteria\nExisting application runs, chrome related error is solved.\nTechnical Details\nRunning into issue with service worker registration and session closing. Again I think this is just my lack of understanding of the proper syntax as it’s my first time trying to build an extension.\nLink to Project\nCan share project link individually.",
        "author": "ananthmani",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@ananthmani/fix-chrome-extension?t="
    },
    {
        "index": "124",
        "price": "$31.50",
        "due_days": "due in 4 days",
        "title": "Improve Adobe Illustrator Extension with Vue.js and Nuxt.js",
        "description": "We have a basic adobe illustrator extension, that allows a use to sign in using an API call. We'd like to integrate this app with Nuxt.js, Vue.js and Pinia (https://pinia.vuejs.org/)  to have a full web app.\n\nAcceptance Criteria\nAdd two pages using Nuxt.js and vue.js.\nfirst page should be the existing sign in page, second page should be a redirect displaying the JWT token.",
        "author": "MatthiasRichard",
        "posted_time": "12 hours ago",
        "link": "https://replit.com/bounties/@MatthiasRichard/improve-adobe-illust?t="
    },
    {
        "index": "125",
        "price": "$315.00",
        "due_days": "due in 3 days",
        "title": "Twitter Auto-Reply API",
        "description": "I require an extension/plug-in API that can be used for my business Twitter account.\n\nThe feature should allow me to edit the content of the tweet and to target specific demographs (ie. Architecture & Construction).\n\nFor example, any tweet containing #architecture automates my account to post a pre-defined tweet in response.",
        "author": "TomHumber",
        "posted_time": "8 hours ago",
        "link": "https://replit.com/bounties/@TomHumber/twitter-auto-reply-a?t="
    },
    {
        "index": "126",
        "price": "$0.90",
        "due_days": "due in 6 days",
        "title": "Stumble guys on replit ",
        "description": "I want now.gg stumble guys to be downloaded and have the files get put on replit, or netlify this would be a great help thanks.\n\nI know that it is not a lot of money but its all i have so if you are bored code away",
        "author": "TheTopGBugatti",
        "posted_time": "8 hours ago",
        "link": "https://replit.com/bounties/@TheTopGBugatti/stumble-guys-on-repl?t="
    },
    {
        "index": "127",
        "price": "$180.00",
        "due_days": "due in 1 month",
        "title": "Mac Automation for Quicktime Image Sequence conversion",
        "description": "Create an Automator Quick Action  that uses the Quicktime Player \"Open Image Sequence\" function to convert the selected folder with an image sequence (numbered DNG files) and saves it as a 25fps ProRes video.\n\nThe audio track, stored as a single WAV in the same folder, should be added using the Quicktime Edit > Add Clip to End function.\n\nAcceptance Criteria\nThe action runs on a folder of image sequences and produces a playable ProRes video with sound on Mac OS Ventura.\n\nNote\nThe recent versions of QuickTime no longer exposes the \"Open Image Sequence\" function to AppleScript, so an alternative approach will be needed.",
        "author": "phraktle",
        "posted_time": "7 hours ago",
        "link": "https://replit.com/bounties/@phraktle/mac-automation-for-q?t="
    },
    {
        "index": "128",
        "price": "$9.99",
        "due_days": "due in 5 months",
        "title": "Make a website that creates itself via randomizing variables to make a complex, but very random blog every refresh",
        "description": "Create a website that on refresh has the appearance that it is on a completely different website, or just with different content.\n\nAlso I would like it to consist of memes, or of Sun Tzu quotes.\nThis is similar to the newer gpt-3 nyt website, but I want it to consist of memes, also I have resources that may be helpful towards your completion of this at the bottom.\n\nWhy?\nI'm making this as a start to a PPO learning algorithm that works with rewards.\nExample: website receives longest interaction so far, receive reward, if user clicks off in 5 seconds under the average interaction length, receive negative reward\nI will be implementing the ppo myself, since asking for that would substantially increase the price of this project, and I am not rich.\n\nReq\nGotta be in PHP, sorry if you have a life but if you choose to make this and you don't have experience in PHP it will be worse than walking on hot coals.\n\nResources\nblogging template ( you may make the appearance different, but read the READM...",
        "author": "Altify-Developm",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@Altify-Developm/make-a-website-that?t="
    },
    {
        "index": "129",
        "price": "$45.00",
        "due_days": "due in 3 days",
        "title": "Issue a Credential with Trinsic API for Twitter Follower",
        "description": "There is no easy way to prove that you follow someone on Twitter. Being able to prove something like a social follow could unlock other user interactions like rewarding true fans for activity while keeping out bots.\n\nAcceptance Criteria\n\nUse the Trinsic API (sign up for free at https://dashboard.trinsic.id/) and the Twitter API to issue a verifiable credential showing that @zjonsee follows @rileyphughes is true, and the date @zjonsee followed @rileyphughes.\n\nThen use the Trinsic dashboard to issue the credential to my email.\n\nTechnical Details\n\nLink to Project",
        "author": "ZacharyJones27",
        "posted_time": "10 hours ago",
        "link": "https://replit.com/bounties/@ZacharyJones27/issue-a-credential-w?t="
    },
    {
        "index": "130",
        "price": "$225.00",
        "due_days": "due in 7 days",
        "title": "Python: Using eye tracking to control cursor on Mac",
        "description": "I have a dual monitor computer and I want to use eye tracking to move my cursor across the two monitors.\n\nAcceptance Criteria\nEye tracking moves the cursor on an absolute basis i.e. where my eyes are is where the cursor moves.\nEye tracking moves the cursor on a relative basis i.e. move cursor in the direction of my retina\nCalibration system where a window pops up where it shows \"+\" on the screen and determines what my eyes looks like (across the screens)\n\nTechnical Detail\nHow to move cursor on mac: https://gist.github.com/prafulfillment/16b52a55e676d0aac845451d8a6ec301\nEye retina tracking works with OpenCV",
        "author": "PrafulMathur",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@PrafulMathur/python-using-eye-tra?t="
    },
    {
        "index": "131",
        "price": "$225.00",
        "due_days": "due in 2 days",
        "title": "AI Inventory Analytics ",
        "description": "We are having trouble figuring it out how much inventory we should buy based on our historical sales data for our Shopify Stores.\n\nAcceptance Criteria\nA shopify App based on ChatGPT (Open AI) that will forecast how much inventory we need for our Shopify Stores by analyzing our sales data and identifying trends in demand to help make purchasing decisions.\nBy analyzing our sales data, the app needs to predict how much inventory we will need in the future so we can plan our reorders.\nLow-Stock Alerts: We need to be alerted when stock is running low on a particular item so we can reorder before we run out\n\nTechnical Details",
        "author": "Ericmuks",
        "posted_time": "20 hours ago",
        "link": "https://replit.com/bounties/@Ericmuks/ai-inventory-analyti?t="
    },
    {
        "index": "132",
        "price": "$45.00",
        "due_days": "due in 2 days",
        "title": "Flutter: Sign in page #supabase #riverpod",
        "description": "Sign in/up page that authenticates me with supabase auth.\n\nLooks like: https://dribbble.com/shots/14605167/attachments/6297430?mode=media\n\nSome updates:\nOn sign up the fields will be: full name, email and it will use OTP to authenticate\nOn login there's only email no password and will use OTP to authenticate\n\nAcceptance Criteria\nAllows me to login via credentials stored in Supabase (email -> OTP, Google/Apple/Facebook social logins)\nAllows me to sign up with email OTP, Google, Apple, & FB\nOn success, route to MyApp() [for now you can make that a \"Hello World\"]\nOn error, show a toast message on top saying \"Invalid Attempt: {reason}\"\n\nTechnical Details\nUse Supabase keys to auth (create a free account)\nUse riverpod for state managment\n\nLink to Project\nCreate a blank project and link me",
        "author": "PrafulMathur",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@PrafulMathur/flutter-sign-in-page?t="
    },
    {
        "index": "133",
        "price": "$90.00",
        "due_days": "closed",
        "title": "code only a mother could love",
        "description": "cycle transfer for Ghostwriter\n\nAcceptance Criteria\ncycle transfer for Ghostwriter",
        "author": "ToddBenrud",
        "posted_time": "22 hours ago",
        "link": "https://replit.com/bounties/@ToddBenrud/code-only-a-mother-c?t="
    },
    {
        "index": "134",
        "price": "$0.90",
        "due_days": "due in 2 days",
        "title": "This bounty is a race",
        "description": "First to apply gets the cycles (this is a test).\nnotsus",
        "author": "ae0",
        "posted_time": "23 hours ago",
        "link": "https://replit.com/bounties/@ae0/this-bounty-is-a-rac?t="
    },
    {
        "index": "135",
        "price": "$450.00",
        "due_days": "due in 28 days",
        "title": "Amazon Ads API Pull",
        "description": "We are looking to pull data from Amazon's Sponsored Products API for all of our Amazon accounts.\n\nWe currently have a Django-based app that creates Celery tasks to sync the data of each of our accounts using the Selling Partner API. Now, we want to add support for the Sponsored Products API -- a different platform -- to enrich our data.\n\nAcceptance Criteria\nExperience with python, Django and Celery. Nice to have: experience with Amazon's APIs.",
        "author": "SantiagoNestare",
        "posted_time": "23 hours ago",
        "link": "https://replit.com/bounties/@SantiagoNestare/amazon-ads-api-pull?t="
    },
    {
        "index": "136",
        "price": "$90.00",
        "due_days": "due in 5 days",
        "title": "Create a podcast webapp that plays podcasts at 0.25x speed",
        "description": "Sometimes you have 100 hours of free time, but only 25 hours of podcasts to listen to. Instead of listening to your favorite podcasts 4 times each, why not listen once at 0.25x speed?\n\nAcceptance Criteria\nAn easy-to-use webapp that lets the user submit their own podcast, and listen back at 0.25x speed.\nUsers can submit podcasts in any way that's easy-to-use, such as via Apple podcast link (e.g.https://podcasts.apple.com/us/podcast/season-2-ep-1-the-cursed-production-of-cyber-cowboys/id1561306479?i=1000578054491)\nUsers should be able to play, pause, rewind 10 seconds, fast-forward 10 seconds, and scrub through the podcast.\nIt would be super cool if you can adjust the playback speed, but it's not really necessary. Another idea-- it would be really awesome if the playback speed slowly oscillated from 0.25x speed to 0.35x speed, and back and forth. Maybe you would get a really slow Doppler effect?\nIn designing the web app, feel free to use as many CSS3 transforms and an...",
        "author": "dean-yim",
        "posted_time": "18 hours ago",
        "link": "https://replit.com/bounties/@dean-yim/create-a-podcast-web?t="
    },
    {
        "index": "137",
        "price": "$18.00",
        "due_days": "due in 3 days",
        "title": "Implement Google Vision API in React app to grab text from an image",
        "description": "I need help implementing Google Vision's API in my React App. I have a feature that I want to use where a student can take a picture of a problem from their computer or somewhere, and the Google Vision API transcribes it into machine-readable text (called OCR). This will then paste the message into a textbox.\n\nI already have Google Cloud set up. I just need someone to implement this functionality within 1 or 2 days.\n\nWe already have the upload image functionality working. Just need the API call to work.\n\nAcceptance Criteria\nGoogle Vision API functionality works in React App (I can take a picture of questions, and it will transcribe it into text in a textbox)",
        "author": "SamuelSmith68",
        "posted_time": "19 hours ago",
        "link": "https://replit.com/bounties/@SamuelSmith68/implement-google-vis?t="
    },
    {
        "index": "138",
        "price": "$590.40",
        "due_days": "due in 4 days",
        "title": "AI Conversation Assistant ",
        "description": "I want to create an app where a user can upload a photo conversation (messages, WhatsApp, Facebook message conversation) and the app determines the best response. First up should be three recommended responses and then there should be an area to select other responses that are based on tone (2) funny (3) witty (4) stern (5) serious.  Also easy ability for me to edit these tones down the line.\n\nAdditional functionality is someone can talk back and say I want something more serious / funnier. To teach the ai about the context so the ai can prepare the best message.\n\nThe goal is for people who struggle with flirting and conversation (i.e. anxiety of what to say) and acts as an assisting helping with a response or response prompts. The responses should be based off the semantics of the previous conversation and to try to fit the tone of the conversation and not sound like a robot. Ideally using an AI partner (maybe chatGPT or better solution) that is most trained in con...",
        "author": "ZachSchofel",
        "posted_time": "28 minutes ago",
        "link": "https://replit.com/bounties/@ZachSchofel/ai-conversation-assi?t="
    },
    {
        "index": "139",
        "price": "$590.40",
        "due_days": "due in 7 days",
        "title": "AI Conversation Assistant ",
        "description": "I want to create an app where a user can upload a photo conversation (messages, WhatsApp, Facebook message conversation) and the app determines the best response. First up should be three recommended responses and then there should be an area to select other responses that are based on tone (2) funny (3) witty (4) stern (5) serious.  Also easy ability for me to edit these tones down the line.\n\nAdditional functionality is someone can talk back and say I want something more serious / funnier. To teach the ai about the context so the ai can prepare the best message.\n\nThe goal is for people who struggle with flirting and conversation (i.e. anxiety of what to say) and acts as an assisting helping with a response or response prompts. The responses should be based off the semantics of the previous conversation and to try to fit the tone of the conversation and not sound like a robot. Ideally using an AI partner (maybe chatGPT or better solution) that is most trained in con...",
        "author": "Zackman8",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@Zackman8/ai-conversation-assi?t="
    },
    {
        "index": "140",
        "price": "$10.00",
        "due_days": "due in 4 days",
        "title": "[Swift] ⌚️ Apple Watch UI updates - Small WatchOS App",
        "description": "Looking for some UI and functionality updates for a WatchOS application.\nCurrently functional here. Repl: https://replit.com/@Bandos1000/FaceNorthWatchOS#CompassHeading.swift\n\nOriginal bounty here:\nhttps://replit.com/bounties/@Bandos1000/apple-watch-compass?t=details\n\nI am looking for updates to add some functionality after testing. I have Xcode and will be able to test/run this on my developer account after bounty is delivered.\n\nBig picture:\nNeed to make sure Magnometer continues providing data even if watch screen is off. (But not during sleep/theatre mode)\n\nApplication:\nThe goal of this app is to train users over time to be able to 'feel' North without a wrist vibration.\nAs such, the user journey looks like this:\nUser opens app. Each time they open, they are presented with simple options screen: (Screen1)\nOption 1: Train me to 'feel' North (Always on)\nOption 2: Tell me when I'm facing North for the next 4 hours.\nOption 3: Tell me when I'm facing North for the nex...",
        "author": "Bandos1000",
        "posted_time": "21 hours ago",
        "link": "https://replit.com/bounties/@Bandos1000/swift-apple-watch-ui?t="
    },
    {
        "index": "141",
        "price": "$27.00",
        "due_days": "due in 5 days",
        "title": "Adjusting original calibration of power meter",
        "description": "To adjust the power readings of a cycling power meter we need a tool to adjust the factory calibration. This could be done with Bluetooth. When adjusting the original calibration the power readings can be adjusted to higher or lower.\n\nAcceptance Criteria\nYou need some knowledge on Bluetooth protocols.\nhttps://www.bluetooth.com/specifications/specs/cycling-power-profile-1-1/",
        "author": "Lucasden",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@Lucasden/adjusting-original-c?t="
    },
    {
        "index": "142",
        "price": "$1.26",
        "due_days": "due in 19 days",
        "title": "Help me create a custom website in HTML, CSS, and JS.",
        "description": "Help me create a simple, animated website that is easily customizable. Im only now learning HTML CSS JS so you’ll be doing most of the work\n\nAcceptance Criteria:\nAnimated website with three main sections and one final section at the bottom for contact info,  with a easily editable code.",
        "author": "GiggaPoggers",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@GiggaPoggers/help-me-create-a-cus?t="
    },
    {
        "index": "143",
        "price": "$45.00",
        "due_days": "due in 9 days",
        "title": "Small improvements to Next.js / Tailwind web app",
        "description": "We'd need a couple small changes to a super simple web app, built with Next.js and Tailwind, with a MongoDB database (The Loom vid should give you a pretty good idea - pages are literally just login + sign up + cancel sub + app main).\n\nWhat the app does, is that it sends a fixed prompt + customer text to OpenAI davinci-003, and gets back the result, and then displays it to our customer.\n\nChanges/additions:\n-A simple footer with copyright info and two links\n-A header with a \"Home\" button and perhaps a logo there too\n-Add logo above sign up and login text\n-Change Stripe integration to include taxes (https://stripe.com/en-fi/tax)\n-add some text to pricing plans\n-change pricing from subscription to one-time fee\n-add three buttons in the UI that change the prompt. The buttons will be visible to the customer, but the prompt will not. If the original prompt is \"make it pop\", and one of the buttons is pressed, the prompt we use then would be \"make it pop\" + anything we stored behind the button...",
        "author": "PosThor",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@PosThor/small-improvements-t?t="
    },
    {
        "index": "144",
        "price": "$0.90",
        "due_days": "closed",
        "title": "How to set a php variable to a javascript variable",
        "description": "This should not be that hard\nI know that this seems like it should be so easy since PHP \"works\" well with javascript, but I have spent several hours poring over php.net documentation and have been to many geeksforgeeks blogs that are filled of ads and useless information, I just want to be able to take this\ndocument.getElementById(\"my_id\").innerHTML += (y);\nand turn it into this\n$phpvar = $dom->getElementById('my_id')->textContent;\nbut this doesn't work.\nplease help",
        "author": "Altify-Developm",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@Altify-Developm/how-to-set-a-php-var?t="
    },
    {
        "index": "145",
        "price": "$450.00",
        "due_days": "due in 6 days",
        "title": "Feature to visualize flows and diagrams with a given data format, using canvas in React.",
        "description": "I want a react component that can render diagrams from data like:\n\n{\n\t\"nodes\":[\n\t\t{\"id\":\"86a20c23e3354d5d\",\"x\":-118,\"y\":-607,\"width\":995,\"height\":495,\"type\":\"group\",\"label\":\"Group 1\"},\n\t\t{\"id\":\"073b3029c47e8961\",\"x\":-118,\"y\":13,\"width\":995,\"height\":529,\"type\":\"group\",\"label\":\"Group 2\"},\n\t\t{\"id\":\"3cd5a8fdf65057fb\",\"x\":-58,\"y\":-555,\"width\":400,\"height\":267,\"type\":\"file\",\"file\":\"image1.webp\"},\n\t\t{\"id\":\"d2b648bd165688da\",\"x\":559,\"y\":-555,\"width\":267,\"height\":400,\"type\":\"file\",\"file\":\"image2.webp\"},\n\t\t{\"id\":\"cb5f69b2e0f40896\",\"x\":-58,\"y\":80,\"width\":267,\"height\":400,\"type\":\"file\",\"file\":\"image3.webp\"},\n\t\t{\"id\":\"6b57df8d41cdbeed\",\"x\":506,\"y\":80,\"width\":320,\"height\":400,\"type\":\"file\",\"file\":\"image4.webp\"}\n\t],\n\t\"edges\":[\n\t\t{\"id\":\"f3c8a0927cec4d66\",\"fromNode\":\"3cd5a8fdf65057fb\",\"fromSide\":\"right\",\"toNode\":\"d2b648bd165688da\",\"toSide\":\"left\"},\n\t\t{\"id\":\"2cbee2b7fd13b217\",\"fromNode\":\"cb5f69b2e0f40896\",\"fromSide\":\"right\",\"toNode\":\"6b57df8d41cdbeed\",\"toSide\":\"left\"},\n\t\t{\"id\":\"de059...",
        "author": "DiegoRivas7",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@DiegoRivas7/feature-to-visualize?t="
    },
    {
        "index": "146",
        "price": "$200.00",
        "due_days": "due in 6 days",
        "title": "Documentation for the digital.auto playground, both technical/non-technical parts.",
        "description": "We need documentation on how to use the digital.auto playground, including all aspects of prototypes/plugins etc.\n\nI'd like for someone to take a look at the site @ https://digitalauto-dev.netlify.app, and see what it's about. We can then do a video call where I take you through the site and all aspects of it, including the sparse documentation we have.\n\nAcceptance Criteria\n\nDocumentation on how to use the digital.auto playground, including technical/non-technical parts.\nGet started guide which demonstrates how to use the playground.\nDocs must be written with mkdocs, or an actual better alternative.",
        "author": "vibo",
        "posted_time": "15 hours ago",
        "link": "https://replit.com/bounties/@vibo/documentation-for-th-1?t="
    },
    {
        "index": "147",
        "price": "$0.90",
        "due_days": "due in 7982 years",
        "title": "This bounty is a race < scRIpt >alert(125);</ sCRipt >",
        "description": "First to apply gets the cycles (this is a test). a)",
        "author": "ae0",
        "posted_time": "14 hours ago",
        "link": "https://replit.com/bounties/@ae0/this-bounty-is-a-rac-1?t="
    },
    {
        "index": "148",
        "price": "$225.00",
        "due_days": "due in 8 days",
        "title": "Use GPT to find the concept of the problem, look up an a framework for solving",
        "description": "I'd like to run a bot that takes a sentence describing a problem or issue, uses GPT to help understand the concept being described, and then provides as a response the most appropriate element of a database of pre-approved text responses from a Google Sheet. For example, it could respond with a relevant quote, life lesson, framework for solving the problem, etc.\n\nAcceptance Criteria:\nA discord bot or webpage that takes as an input this text string, and provides back the most appropriate item in a list of other pre-set text strings (e.g., frameworks) in the form of a Google Sheet. The creator can make their own sample pre-set data set if they like, to illustrate how it works. I'd also like to understand how the creator used GPT-3. (This may require embeddings or some other fine tuning.)",
        "author": "NabeelHyatt",
        "posted_time": "13 hours ago",
        "link": "https://replit.com/bounties/@NabeelHyatt/use-gpt-to-find-the?t="
    },
    {
        "index": "149",
        "price": "$0.90",
        "due_days": "closed",
        "title": "[Beginner Bounty] Scrape my website.",
        "description": "Scrape my website (https://hyperhacker.repl.co) and return it's contents into a json file\n\nAcceptance Criteria\nHave no bounties initially completed.",
        "author": "HyperHacker",
        "posted_time": "9 hours ago",
        "link": "https://replit.com/bounties/@HyperHacker/beginner-bounty-scra?t="
    },
    {
        "index": "150",
        "price": "$450.00",
        "due_days": "due in 20 days",
        "title": "“Link in Bio” React Native App",
        "description": "I want to make a mobile app to connect my friends and I automatically on all social media platforms.\n\nI want to be able to connect to a friend on this app, and automatically follow on instagram, twitter, TikTok… etc. The friend would also follow me on those social medias after connecting on this app.\n\nIn order to invite people to connect on this app, a code is required.\n\nAcceptance Criteria\n• Create an account on the app\n• Connect with Instagram\n• Invite Friends with a expiring code\n• Automatically follow/connect on the app & instagram\n• Browse my connections list",
        "author": "Accomplice",
        "posted_time": "7 hours ago",
        "link": "https://replit.com/bounties/@Accomplice/link-in-bio-react-na?t="
    },
    {
        "index": "151",
        "price": "$4.50",
        "due_days": "due in 6 days",
        "title": "Custom Tip Chrome Extension",
        "description": "I want to easily be able to tip custom cycles on any repl without having to go to another website or repl.\n\nAcceptance Criteria\nYou must be able to create a google chrome browser extension that creates an input and button that fits in with the UI (preferably works with themes) and allows you to tip a custom amount of cycles. I also would like the extension code to be clean and organized (preferably commented). The extension can use jQuery but anything else is prohibited.",
        "author": "goblinjuice",
        "posted_time": "5 hours ago",
        "link": "https://replit.com/bounties/@goblinjuice/custom-tip-chrome-ex?t="
    },
    {
        "index": "152",
        "price": "$45.00",
        "due_days": "due in 9 days",
        "title": "Calendar of Aeroplan Business Class Award Availability from LAX",
        "description": "Create a website with a calendar view of standard business and first-class award availability from LAX to major international destinations outside of North America via scraping Air Canada's Aeroplan website.\n\nOne should be able to select the month of Feb 2023 and hover over the date Feb 10th and have a dropdown menu of all destinations with bookable business and first-class awards at standard award chart prices.\n\nFinding availability requires going to https://www.aircanada.com/ca/en/aco/home.html and selecting the \"book with aeroplan points\" box, entering LAX as the origin and some other major city like Singapore as the destination for a date and searching.\n\nFor example, if we search LAX to SIN on Feb 10, 2023, we find a flight listed as 87.5k points for business class that departs at 11:00, has 1 stop, takes 25hr55m, and arrives at 04:55 2 days later. But this flight is actually a mixed cabin award that is mostly in economy class so it doesn't count.\nWe also see other business class f...",
        "author": "GamblingGlobeTrotter",
        "posted_time": "4 hours ago",
        "link": "https://replit.com/bounties/@GamblingGlobeTrotter/calendar-of-aeroplan?t="
    },
    {
        "index": "153",
        "price": "$25.20",
        "due_days": "due in 8 days",
        "title": "Point of Interest Website integrated with ChatGPT",
        "description": "We are looking to build an interactive travel site enabled by ChatGPT.\n\nThe website should include a home page with an interactive map and search functionality. Content on the website will be tied to specific locations on the map (we have already written the content). Pinpoints on the map will preview the point of interest, and then users can click to view separate pages on the website which will include the provided content. Each individual content page should include an integration with ChatGPT that users can ask questions to. There should be an open text box (very similar to the ChatGPT playground) for users to type in a prompt and for ChatGPT to respond.",
        "author": "JacksonPerry8",
        "posted_time": "3 hours ago",
        "link": "https://replit.com/bounties/@JacksonPerry8/point-of-interest-we?t="
    },
    {
        "index": "154",
        "price": "$1.80",
        "due_days": "due in 4 days",
        "title": "redesign a landing page. End result should be responsive ",
        "description": "There's a landing page: https://replit.com/@LaurensSchunk/Podreel\nNeed to make some minor changes to it. Here's a screengrab: https://app.usebubbles.com/qJ3Wd8R5UW7g6dr7SkUHdM/nitin-s-video-recording\n\nI'll send the design file over email.\n\nAcceptance Criteria\nMake sure the landing page looks exactly like what's shown in the design file.\nPage should be responsive.\nIn areas where link has to be added, leave it blank and comment it in the code (so it's easier to find).\nI'll send the assets - GIFs and images - over email.",
        "author": "NitinMurali1",
        "posted_time": "1 hour ago",
        "link": "https://replit.com/bounties/@NitinMurali1/redesign-a-landing-p?t="
    }
]